{
  "text": " In this lecture we're going to look at the case of Binance and see how that is different from the HyperLiquids case. So here we're going to look at case for Binance. But to start off we have a different funding interval, right? In Binance we have funding intervals of four hours and eight hours, whereas inside hyperliquet we have funding interval for the entirety of the period. It's always one hour. And we know that the reference price to which the funding payment is computed is with reference to this Oracle price. However, what we have is the funding payment is equal to some minimum max figure. Right, these are the maximum and the minimum funding rate caps and here, you know, I'm not sure exactly what the caps are yet, but okay, we have this funding rate cap, and then we multiply it by the notional size, where the notional size is this reference to the mark price rather than the oracle price. And we know that in hyper liquid, we take the position times P.O, which is the price of the oracle. And in finance, we have we have we have we have the not the noten, we have the not notion, we have the not notion, we have the notional, we have the price of the article and in finance we have the notional size computed by the mark price. And we have the interval quite interestingly has a payment deviation by one minute so the cash flow or the the swap. The funding interval is at 12 o'clock even at 12.45 or even at $12.58 it is possible that you have not yet proceed not yet receive this funding accrued interesting thing that we will have to take into consideration when we implement it in our algorithm the funding rate presented on the Binance website or when you request for the API is actually presented as a rolling interval of 8 hours. So here we have T minus 8. This means that the funding rate figure provided uses data that is not included in the next funding payment, which means that this component of the funding rate competition or the funding rate figure that is presented has already been paid out to and therefore this can be a figure that it's somewhat misleading and only when the figures only when this time interval intersects or mostly overlaps with the actual funding payment then this funding rate figure is going to be accurate representation of the actual swap payments. The interest rate is also constant at 0.1% per hour, which also represents the difference between the USD and spot borrow. Here we also have the concept of a impact price which is taken to be the bid impact price minus the price of the Oracle subtracted by the price of the Oracle minus the ask impact price with a max function applied to it. to it. Similarly we have the premium index which is taken to be the impact price denominated by the Oracle price price and this is often called to be the price index. So some difference in terminology the spot Oracle or the Oracle price is not known to be the price index. is not known to be the price index. So some difference in terminology, the spot Oracle or the Oracle price is now known to be the price index. The funding impact notional is slightly different, so funding impact notional is given to be the notional available using $200 USDT margin. Now suppose you are allowed to trade a 50 leverage, then the notional available is given by this. If you are allowed at 20 leverage, then your notional available is simply 4,000. And that depends on the contract that you're trading, the leverage allowable on that particular contract is different, and so therefore your funding impact notional is also going to vary for the computation of the impact price. Now we're just going to look at one side, right? The other side is now let's suppose that we have some, let's treat this to be impact margin notional available. Define X to be the price level such that this inequality is whole. Right, so we're going to let X be such that the summation of the price at the levels from top of book, so prior to X be greater than the impact marginal notional and the level just before this impact margin notional is going to be lesser than this figure over here. Now what is this saying? Now suppose that you have some order book. Now your order book can be level zero, one, two, three, so on. And these are your different prices. If you're looking at the bid, then we're going to have to hit the ask side of the order book. So the prices are going to be 49, it's going to be increasing, right? So the offer price is going to be increased as you go deeper in the book, and this is going to be some quantity, some quantity. Now, so suppose that we have two contracts offered at 49 and one contract offered at 50. So in order to compute the impact price, we want to compute the adjusted price based on the volume at each level. To do this, we're going to take, so the impact marginal notional, for this particular example we have over here. Now suppose that impact margin notional for this particular example we have over here. Now suppose that impact margin notional is equals to 100, then P bid is going to be 100 over 100 minus 98 over 50 plus 2. Why? Because we can pick up $98 worth of contracts at the top of the orderbook, and we can only pick up $2 worth of the contract at one level deeper than that. So this is telling us the volume you want to use at the second at one level deeper than that. Right? So this is telling us the volume you want to use at the at the level that is prior to X and this is the volume that you want to pick up at level X. So this is going to be written by price, the impact bid price, if given by the impact margin notional, denominated by the sum of the quantity you can pick up prior to level X, plus the quantity that you can pick up at level X. So this is given by this figure over here. So this is the quantity that you can pick up that is prior to level X here. And at level X, you have already picked up this amount of volume and this is the number of this is the margin notional left and you want to divide it by this price at level X so this is how you compute the impact margin notional sorry this is how you compute the bid impact price from the order book and the impact margin notional. So I hope that this demonstration over here has been helpful and helping you understand how the bid impact price is computed. Again, it is simply just the concept of VWOP through the order book at that instance. This is going to be sampled every five seconds so a number of samples is going to be 60 over 5 so this is the number of samples in a minute number of samples in an hour times number of samples in a funding rate interval. So this is the samples used to compute the premium index. Sorry, this is the number of samples of premium index bar and this P-bar R is now given to be computed by the formula and I equals to 1, I-P-I-R is now given to be computed by the formula n-I-I-e-to 1 i p i over summation of i the how does this look like it's basically going to be one p1 plus 2 p2 plus dot dot all the way until let's say n is equal to sorry let's just let this be P n and this is going to be 1 plus 2 plus n. So this means that the samples of the premium index that is closer to to the current time is going to be more important in the figure for the funding rate interval relative to the previous samples. Given these different variables we can now compute the funding rate. The funding rate is then given by this P-bar-I plus mean-max or the clamp formula and take the interest rate minus P bar I and this is further given a clamp of 0.05%. The difference, the key difference between Binance and Hyperliquid is essentially the funding interval, the use of the mark price rather than the Oracle price to compute the notion of exposure. Even though hyperliquid does not mention how the funding rate is presented, in Binance we are sure that the funding rate figure can include samples that are outside of the that have already been accounted for and so therefore not useful to the computation or to computing the funding premium accrued in the current contract. The funding impact notional is also different right so this is using $200 of margin right the notional available using that margin level and everything else is more or less the same. One more additional thing that we are not sure whether it's different is the waiting right we don't know how the P bar I is constructed in hyperlucid but we know that in Binan's it follows this we also know that there is a one-mini deviation in the funding settlement for Binance we are not sure whether there is disdification in the in hyperloquid. It's possible that hyperlucate pays on the dot at that at that interval. There are a number of differences in the rules and it is possible that we want to adjust for this idiosyncrasies with more carefully if you want to create a more specific model rather than a generalized model. One important thing to note is that it is possible for you to come up with a funding rate figure that is more accurate than what is presented in the figures by the API, by simply taking away the data samples that are irrelevant to the funding rate competition of the current period, right? It is something that you can do, however, in our demonstration again we are showing a lot of approximations and therefore we're not going to make this adjustment but I believe that is a quite a nice adjustment that you can make in your own models if you want to take what we are demonstrating one step further. The funding impact notion also suggests that the greater the market is illiquid, the greater the illiquidity of the market, it is likely to have a more volatile or a larger magnitude funding premiums, right? Why? Now assume that the market is illiquid, then the impact bid price is going to be greater than the impact us price. This is as opposed to the assumption that we made before that we have a frictionless one price model, in which case the impact bid price and the impact us price are exactly one in the same. However, if we make this assumption even more, if we strengthen the assumption, then in the very strong case, the impact bid price is much greater than assumption even more. If we strengthen the assumption, then in the very strong case, the impact bid price is much greater than the impact us price. And you can then input this figures back into the funding formulas, and you will realize that the illiquid markets or illiquid coins are likely to have larger funding premiums. Now if it has large funding premiums then you are likely to find better opportunities in these liquid coins although there is not that much capacity. However, one thing you have to notice that these markets are also likely to be those markets where they allow as little leverage as possible, right? Because oftentimes you see that you can trade you know 20 times or 50 times leverage on Bitcoin on Bitcoins. However, you know if you're trading some very obscure shitcoin, then you can only trade it on, say, five times leverage. So often, illiquid coins have lower leverage allowed by the exchange, and therefore have larger margin requirements. This gives us an idea as to the nature of what you're being compensated for, right? There is a reason why you're being compensated for, you are compensated for holding coins that are less liquid and therefore more risky, and at the same time they have lower leverage allowed, so therefore it's going to be capital inefficient. that means that funding right note that funding requires holding positions long short that are mechanically convergent and often for long durations at a time. So, mechanically conversion positions, often for weeks or days at a time. And this should point you to the direction that funding is a compensation for provision of liquidity. So funding is liquidity provision of liquidity. So funding is liquidity provision premium. You are getting paid to hold these positions without getting liquidated. You're managing the risk and therefore you are being compensated for this risk. And the reasons for this compensation also becomes clear because you can actually see inside the formula that the riskier it is, the higher it is your compensation, at the same time the more difficult it is to obtain this liquidity precisely because you're being compensated for providing this liquidity, right? So therefore, if it is easier to source for liquidity, then you would likely receive lower funding premiums. This means that this should also hint to you that the more esoteric or the more far-reaching your goal in terms of trying to calibrate with, let's say, an exchange that does not have many arbitrators, then you're also more likely to benefit or be compensated by the provision of state liquidity. So therefore, look for opportunities where this premium is high. Right. So you want to A, look for areas where your liquidity is compensated to a good degree. So, to a good degree, and at the same time, you want to diversify because you don't want to put all your funds in a particular exchange that is not well reputable because, well, I mean, risk, you know, sometimes it looks like a very, very good premium, but a lot of times it is priced risk. So you know, you want to make that good distinction, and a lot of the times it's mispriced premium, right, and those are things that you might want to consider while we implement the funding arbitrage. So now that we have done this case studies, I recommend that you go through these two lectures again and understand really deep down what the funding arbitrage is how they are broken down in different exchanges as well as try to internalize why this profit exists, right? It doesn't exist because you know it's risk-free. Now obviously you are being compensated for providing a risk premium. And the degree of compensation now depends on how well you can execute on this and detect opportunities.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        25.0
      ],
      "text": " In this lecture we're going to look at the case of Binance and see how that is different from the HyperLiquids case. So here we're going to look at case for Binance. But to start off we have a different funding interval, right? In Binance we have funding intervals of four hours and eight hours,"
    },
    {
      "timestamp": [
        25.0,
        31.0
      ],
      "text": " whereas inside hyperliquet we have funding interval for the entirety of the period."
    },
    {
      "timestamp": [
        31.0,
        34.0
      ],
      "text": " It's always one hour."
    },
    {
      "timestamp": [
        34.0,
        40.0
      ],
      "text": " And we know that the reference price to which the funding payment is computed"
    },
    {
      "timestamp": [
        40.0,
        44.0
      ],
      "text": " is with reference to this Oracle price."
    },
    {
      "timestamp": [
        44.0,
        49.2
      ],
      "text": " However, what we have is the funding"
    },
    {
      "timestamp": [
        49.2,
        59.92
      ],
      "text": " payment is equal to some minimum max figure. Right, these are the maximum and the"
    },
    {
      "timestamp": [
        59.92,
        65.68
      ],
      "text": " minimum funding rate caps and here, you know, I'm not sure exactly what the caps are yet,"
    },
    {
      "timestamp": [
        65.68,
        67.6
      ],
      "text": " but okay, we have this funding rate cap,"
    },
    {
      "timestamp": [
        67.6,
        71.44
      ],
      "text": " and then we multiply it by the notional size,"
    },
    {
      "timestamp": [
        71.44,
        75.6
      ],
      "text": " where the notional size is this reference to the mark price"
    },
    {
      "timestamp": [
        75.6,
        76.88
      ],
      "text": " rather than the oracle price."
    },
    {
      "timestamp": [
        76.88,
        77.96
      ],
      "text": " And we know that in hyper liquid,"
    },
    {
      "timestamp": [
        77.96,
        81.6
      ],
      "text": " we take the position times P.O, which is the price of the oracle."
    },
    {
      "timestamp": [
        81.6,
        85.92
      ],
      "text": " And in finance, we have we have we have we have the not the noten, we have the not notion, we have the not notion, we have the notional, we have the price of the article and in finance we have the notional size computed by the mark price."
    },
    {
      "timestamp": [
        85.92,
        94.44
      ],
      "text": " And we have the interval quite interestingly has a payment deviation by one minute so"
    },
    {
      "timestamp": [
        94.44,
        103.72
      ],
      "text": " the cash flow or the the swap. The funding interval is at 12 o'clock even at 12.45 or even at"
    },
    {
      "timestamp": [
        103.72,
        126.8
      ],
      "text": " $12.58 it is possible that you have not yet proceed not yet receive this funding accrued interesting thing that we will have to take into consideration when we implement it in our algorithm the funding rate presented on the Binance website or when you request"
    },
    {
      "timestamp": [
        126.8,
        133.28
      ],
      "text": " for the API is actually presented as a rolling interval of 8 hours."
    },
    {
      "timestamp": [
        133.28,
        212.24
      ],
      "text": " So here we have T minus 8. This means that the funding rate figure provided uses data that is not included in the next funding payment, which means that this component of the funding rate competition or the funding rate figure that is presented has already been paid out to and therefore this can be a figure that it's somewhat misleading and only when the figures only when this time interval intersects or mostly overlaps with the actual funding payment then this funding rate figure is going to be accurate representation of the actual swap payments. The interest rate is also constant at 0.1% per hour, which also"
    },
    {
      "timestamp": [
        212.24,
        218.16
      ],
      "text": " represents the difference between the USD and spot borrow. Here we also have the"
    },
    {
      "timestamp": [
        218.16,
        269.04
      ],
      "text": " concept of a impact price which is taken to be the bid impact price minus the price of the Oracle subtracted by the price of the Oracle minus the ask impact price with a max function applied to it. to it. Similarly we have the premium index which is taken to be the impact price denominated by the Oracle price price and this is often called to be the price index. So some difference in terminology the spot Oracle or the Oracle price is not known to be the price index. is not known to be the price index. So some difference in terminology, the spot Oracle or the Oracle price is now known"
    },
    {
      "timestamp": [
        269.04,
        276.96
      ],
      "text": " to be the price index. The funding impact notional is slightly different, so funding impact"
    },
    {
      "timestamp": [
        278.72,
        293.44
      ],
      "text": " notional is given to be the notional available using $200 USDT margin."
    },
    {
      "timestamp": [
        296.4,
        307.0
      ],
      "text": " Now suppose you are allowed to trade a 50 leverage, then the notional available is given by this."
    },
    {
      "timestamp": [
        309.0,
        313.0
      ],
      "text": " If you are allowed at 20 leverage, then your notional available is simply 4,000."
    },
    {
      "timestamp": [
        313.0,
        316.0
      ],
      "text": " And that depends on the contract that you're trading,"
    },
    {
      "timestamp": [
        316.0,
        319.0
      ],
      "text": " the leverage allowable on that particular contract is different,"
    },
    {
      "timestamp": [
        319.0,
        323.0
      ],
      "text": " and so therefore your funding impact notional is also going to vary"
    },
    {
      "timestamp": [
        323.0,
        326.32
      ],
      "text": " for the computation of the impact"
    },
    {
      "timestamp": [
        326.32,
        327.32
      ],
      "text": " price."
    },
    {
      "timestamp": [
        327.32,
        329.2
      ],
      "text": " Now we're just going to look at one side, right?"
    },
    {
      "timestamp": [
        329.2,
        338.6
      ],
      "text": " The other side is now let's suppose that we have some, let's treat this to be impact margin"
    },
    {
      "timestamp": [
        338.6,
        340.48
      ],
      "text": " notional available."
    },
    {
      "timestamp": [
        340.48,
        385.0
      ],
      "text": " Define X to be the price level such that this inequality is whole. Right, so we're going to let X be such that the summation of the price at the levels from top of book, so prior to X be greater than the impact marginal notional and the level just before this impact margin notional is going to be lesser than this figure over here."
    },
    {
      "timestamp": [
        386.56,
        387.48
      ],
      "text": " Now what is this saying?"
    },
    {
      "timestamp": [
        387.48,
        389.76
      ],
      "text": " Now suppose that you have some order book."
    },
    {
      "timestamp": [
        389.76,
        393.96
      ],
      "text": " Now your order book can be level zero,"
    },
    {
      "timestamp": [
        393.96,
        395.8
      ],
      "text": " one, two, three, so on."
    },
    {
      "timestamp": [
        395.8,
        397.84
      ],
      "text": " And these are your different prices."
    },
    {
      "timestamp": [
        397.84,
        400.84
      ],
      "text": " If you're looking at the bid,"
    },
    {
      "timestamp": [
        400.84,
        405.0
      ],
      "text": " then we're going to have to hit the ask side of the order book."
    },
    {
      "timestamp": [
        405.0,
        411.0
      ],
      "text": " So the prices are going to be 49, it's going to be increasing, right?"
    },
    {
      "timestamp": [
        411.0,
        416.0
      ],
      "text": " So the offer price is going to be increased as you go deeper in the book,"
    },
    {
      "timestamp": [
        416.0,
        420.0
      ],
      "text": " and this is going to be some quantity, some quantity."
    },
    {
      "timestamp": [
        420.0,
        429.48
      ],
      "text": " Now, so suppose that we have two contracts offered at 49 and one contract offered at 50."
    },
    {
      "timestamp": [
        429.48,
        436.04
      ],
      "text": " So in order to compute the impact price, we want to compute the adjusted price based on"
    },
    {
      "timestamp": [
        436.04,
        438.8
      ],
      "text": " the volume at each level."
    },
    {
      "timestamp": [
        438.8,
        444.84
      ],
      "text": " To do this, we're going to take, so the impact marginal notional, for this particular"
    },
    {
      "timestamp": [
        444.84,
        446.24
      ],
      "text": " example we have over here. Now suppose that impact margin notional for this particular example we have over here."
    },
    {
      "timestamp": [
        446.24,
        456.96
      ],
      "text": " Now suppose that impact margin notional is equals to 100, then P bid is going to be 100 over"
    },
    {
      "timestamp": [
        456.96,
        465.0
      ],
      "text": " 100 minus 98 over 50 plus 2."
    },
    {
      "timestamp": [
        465.0,
        465.28
      ],
      "text": " Why?"
    },
    {
      "timestamp": [
        465.28,
        470.84
      ],
      "text": " Because we can pick up $98 worth of contracts"
    },
    {
      "timestamp": [
        470.84,
        481.08
      ],
      "text": " at the top of the orderbook, and we can only pick up $2 worth of the contract at one"
    },
    {
      "timestamp": [
        481.08,
        482.88
      ],
      "text": " level deeper than that."
    },
    {
      "timestamp": [
        482.88,
        487.6
      ],
      "text": " So this is telling us the volume you want to use at the second at one level deeper than that. Right? So this is telling us the volume"
    },
    {
      "timestamp": [
        487.6,
        497.36
      ],
      "text": " you want to use at the at the level that is prior to X and this is the volume"
    },
    {
      "timestamp": [
        497.36,
        508.64
      ],
      "text": " that you want to pick up at level X. So this is going to be written by price, the impact bid price, if given by the impact"
    },
    {
      "timestamp": [
        508.64,
        521.28
      ],
      "text": " margin notional, denominated by the sum of the quantity you can pick up prior to level X, plus"
    },
    {
      "timestamp": [
        521.28,
        525.0
      ],
      "text": " the quantity that you can pick up at level X."
    },
    {
      "timestamp": [
        528.44,
        534.6
      ],
      "text": " So this is given by this figure over here."
    },
    {
      "timestamp": [
        534.6,
        542.6
      ],
      "text": " So this is the quantity that you can pick up that is prior to level X here."
    },
    {
      "timestamp": [
        543.2,
        591.4
      ],
      "text": " And at level X, you have already picked up this amount of volume and this is the number of this is the margin notional left and you want to divide it by this price at level X so this is how you compute the impact margin notional sorry this is how you compute the bid impact price from the order book and the impact margin notional. So I hope that this demonstration over here has been helpful and helping you understand how the bid impact price is computed. Again, it is simply just the concept of VWOP through the order book at that instance. This is going to be sampled every five seconds so a number of samples is going to be 60 over 5 so this is"
    },
    {
      "timestamp": [
        591.4,
        597.68
      ],
      "text": " the number of samples in a minute number of samples in an hour times number of"
    },
    {
      "timestamp": [
        597.68,
        610.44
      ],
      "text": " samples in a funding rate interval. So this is the samples used to compute the premium index. Sorry,"
    },
    {
      "timestamp": [
        610.44,
        619.16
      ],
      "text": " this is the number of samples of premium index bar and this P-bar R is now given"
    },
    {
      "timestamp": [
        619.16,
        621.56
      ],
      "text": " to be computed by the formula and I equals to 1, I-P-I-R is now given to be computed by the formula"
    },
    {
      "timestamp": [
        621.56,
        667.12
      ],
      "text": " n-I-I-e-to 1 i p i over summation of i the how does this look like it's basically going to be one p1 plus 2 p2 plus dot dot all the way until let's say n is equal to sorry let's just let this be P n and this is going to be 1 plus 2 plus n. So this means that the samples of the premium index that is closer to to the current time is going to be more important in the figure for the funding rate interval relative to the previous samples."
    },
    {
      "timestamp": [
        667.12,
        672.48
      ],
      "text": " Given these different variables we can now compute the funding rate. The funding rate is then"
    },
    {
      "timestamp": [
        672.48,
        689.12
      ],
      "text": " given by this P-bar-I plus mean-max or the clamp formula and take the interest rate minus P bar I and this is further given a clamp"
    },
    {
      "timestamp": [
        689.12,
        694.32
      ],
      "text": " of 0.05%."
    },
    {
      "timestamp": [
        694.32,
        700.2
      ],
      "text": " The difference, the key difference between Binance and Hyperliquid is essentially the funding"
    },
    {
      "timestamp": [
        700.2,
        767.36
      ],
      "text": " interval, the use of the mark price rather than the Oracle price to compute the notion of exposure. Even though hyperliquid does not mention how the funding rate is presented, in Binance we are sure that the funding rate figure can include samples that are outside of the that have already been accounted for and so therefore not useful to the computation or to computing the funding premium accrued in the current contract. The funding impact notional is also different right so this is using $200 of margin right the notional available using that margin level and everything else is more or less the same. One more additional thing that we are not sure whether it's different is the waiting right we don't know how the P bar I is constructed in hyperlucid but we know that in Binan's it follows this we also know that there is a one-mini deviation in the funding settlement for Binance we are not sure whether there is disdification in the in"
    },
    {
      "timestamp": [
        767.36,
        774.24
      ],
      "text": " hyperloquid. It's possible that hyperlucate pays on the dot at that at that"
    },
    {
      "timestamp": [
        774.24,
        781.24
      ],
      "text": " interval. There are a number of differences in the rules and it is possible"
    },
    {
      "timestamp": [
        781.24,
        806.36
      ],
      "text": " that we want to adjust for this idiosyncrasies with more carefully if you want to create a more specific model rather than a generalized model. One important thing to note is that it is possible for you to come up with a funding rate figure that is more accurate than what is presented in the figures by the API, by simply taking away the data samples that are"
    },
    {
      "timestamp": [
        806.36,
        811.28
      ],
      "text": " irrelevant to the funding rate competition of the current period, right? It is"
    },
    {
      "timestamp": [
        811.28,
        815.56
      ],
      "text": " something that you can do, however, in our demonstration again we are showing a"
    },
    {
      "timestamp": [
        815.56,
        818.44
      ],
      "text": " lot of approximations and therefore we're not going to make this adjustment"
    },
    {
      "timestamp": [
        818.44,
        867.52
      ],
      "text": " but I believe that is a quite a nice adjustment that you can make in your own models if you want to take what we are demonstrating one step further. The funding impact notion also suggests that the greater the market is illiquid, the greater the illiquidity of the market, it is likely to have a more volatile or a larger magnitude funding premiums, right? Why? Now assume that the market is illiquid, then the impact bid price is going to be greater than the impact us price. This is as opposed to the assumption that we made before that we have a frictionless"
    },
    {
      "timestamp": [
        867.52,
        873.44
      ],
      "text": " one price model, in which case the impact bid price and the impact us price are exactly one"
    },
    {
      "timestamp": [
        873.44,
        884.88
      ],
      "text": " in the same. However, if we make this assumption even more, if we strengthen the assumption,"
    },
    {
      "timestamp": [
        884.88,
        885.0
      ],
      "text": " then in the very strong case, the impact bid price is much greater than assumption even more. If we strengthen the assumption,"
    },
    {
      "timestamp": [
        885.0,
        887.0
      ],
      "text": " then in the very strong case,"
    },
    {
      "timestamp": [
        887.0,
        891.0
      ],
      "text": " the impact bid price is much greater than the impact us price."
    },
    {
      "timestamp": [
        891.0,
        896.0
      ],
      "text": " And you can then input this figures back into the funding formulas,"
    },
    {
      "timestamp": [
        896.0,
        897.0
      ],
      "text": " and you will realize that"
    },
    {
      "timestamp": [
        897.0,
        913.6
      ],
      "text": " the illiquid markets or illiquid coins are likely to have larger funding premiums. Now if it has large funding premiums then"
    },
    {
      "timestamp": [
        913.6,
        921.6
      ],
      "text": " you are likely to find better opportunities in these liquid coins although"
    },
    {
      "timestamp": [
        921.6,
        946.36
      ],
      "text": " there is not that much capacity. However, one thing you have to notice that these markets are also likely to be those markets where they allow as little leverage as possible, right? Because oftentimes you see that you can trade you know 20 times or 50 times leverage on Bitcoin on Bitcoins. However, you know if you're trading some very obscure shitcoin,"
    },
    {
      "timestamp": [
        946.36,
        949.04
      ],
      "text": " then you can only trade it on, say, five times leverage."
    },
    {
      "timestamp": [
        949.04,
        953.96
      ],
      "text": " So often, illiquid coins have lower leverage allowed by the exchange,"
    },
    {
      "timestamp": [
        953.96,
        961.96
      ],
      "text": " and therefore have larger margin requirements."
    },
    {
      "timestamp": [
        961.96,
        1007.0
      ],
      "text": " This gives us an idea as to the nature of what you're being compensated for, right? There is a reason why you're being compensated for, you are compensated for holding coins that are less liquid and therefore more risky, and at the same time they have lower leverage allowed, so therefore it's going to be capital inefficient. that means that funding right note that funding requires holding positions long short that are mechanically convergent and often for long durations at a time."
    },
    {
      "timestamp": [
        1007.0,
        1014.0
      ],
      "text": " So, mechanically conversion positions, often for weeks or days at a time."
    },
    {
      "timestamp": [
        1014.0,
        1020.0
      ],
      "text": " And this should point you to the direction that funding is a compensation for provision of liquidity."
    },
    {
      "timestamp": [
        1020.0,
        1021.0
      ],
      "text": " So funding is liquidity provision of liquidity."
    },
    {
      "timestamp": [
        1021.0,
        1031.0
      ],
      "text": " So funding is liquidity provision premium."
    },
    {
      "timestamp": [
        1031.0,
        1035.0
      ],
      "text": " You are getting paid to hold these positions without getting liquidated."
    },
    {
      "timestamp": [
        1035.0,
        1041.0
      ],
      "text": " You're managing the risk and therefore you are being compensated for this risk."
    },
    {
      "timestamp": [
        1041.0,
        1049.04
      ],
      "text": " And the reasons for this compensation also becomes clear because you can actually see"
    },
    {
      "timestamp": [
        1049.04,
        1056.0
      ],
      "text": " inside the formula that the riskier it is, the higher it is your compensation, at the same"
    },
    {
      "timestamp": [
        1056.0,
        1061.36
      ],
      "text": " time the more difficult it is to obtain this liquidity precisely because you're being compensated"
    },
    {
      "timestamp": [
        1061.36,
        1063.68
      ],
      "text": " for providing this liquidity, right?"
    },
    {
      "timestamp": [
        1063.68,
        1067.2
      ],
      "text": " So therefore, if it is easier to source for liquidity,"
    },
    {
      "timestamp": [
        1073.0,
        1077.0
      ],
      "text": " then you would likely receive lower funding premiums."
    },
    {
      "timestamp": [
        1080.76,
        1092.0
      ],
      "text": " This means that this should also hint to you that the more esoteric or the more far-reaching"
    },
    {
      "timestamp": [
        1092.0,
        1097.48
      ],
      "text": " your goal in terms of trying to calibrate with, let's say, an exchange that does not have"
    },
    {
      "timestamp": [
        1097.48,
        1107.56
      ],
      "text": " many arbitrators, then you're also more likely to benefit or be compensated by the provision of state liquidity."
    },
    {
      "timestamp": [
        1107.56,
        1117.68
      ],
      "text": " So therefore, look for opportunities where this premium is high."
    },
    {
      "timestamp": [
        1117.68,
        1122.68
      ],
      "text": " Right."
    },
    {
      "timestamp": [
        1122.68,
        1123.04
      ],
      "text": " So you want to A, look for areas where your liquidity is compensated to a good degree."
    },
    {
      "timestamp": [
        1123.04,
        1130.44
      ],
      "text": " So, to a good degree,"
    },
    {
      "timestamp": [
        1130.44,
        1134.28
      ],
      "text": " and at the same time, you want to diversify because you don't want to put all your funds"
    },
    {
      "timestamp": [
        1134.28,
        1144.48
      ],
      "text": " in a particular exchange that is not well reputable because, well, I mean, risk, you know,"
    },
    {
      "timestamp": [
        1144.48,
        1188.0
      ],
      "text": " sometimes it looks like a very, very good premium, but a lot of times it is priced risk. So you know, you want to make that good distinction, and a lot of the times it's mispriced premium, right, and those are things that you might want to consider while we implement the funding arbitrage. So now that we have done this case studies, I recommend that you go through these two lectures again and understand really deep down what the funding arbitrage is how they are broken down in different exchanges as well as try to internalize why this profit exists, right?"
    },
    {
      "timestamp": [
        1188.0,
        1190.0
      ],
      "text": " It doesn't exist because you know it's risk-free."
    },
    {
      "timestamp": [
        1190.0,
        1193.0
      ],
      "text": " Now obviously you are being compensated for providing a risk premium."
    },
    {
      "timestamp": [
        1193.0,
        1200.0
      ],
      "text": " And the degree of compensation now depends on how well you can execute on this and detect opportunities."
    }
  ]
}