{
  "text": " In this lecture we are going to be looking at the funding formula for HyperLiquid. Before we go into the specifications of each exchange, we want to talk about a particular concept known as the mark price. So why is there a concept known as the mark price? So let's just talk about different kinds of prices that we have, right? First is the actual contract price on a particularthe contract price on a particular exchange say let's say exchange A exchange A right this is bound to list a number of contracts this can be a something like you can have perpetuals on some spot asset so you can have spot contract slash price. You can also have the perpetual contract Slash price. Now on most exchanges you're going to have both spot and perpetual contracts. However, for perpetual that exists, I have a liquid you only see the perpetual contracts listed. However, this does not mean that there is no such thing as a spot price because remember the perpetual is a derivative and the underlying is a reference price and that must itself be what is known as the spot price. So sometimes what you have are known as spot oracles, right? So this perpetual derivatives without spot, with the underlying spots, often take reference to this spot price. Right, so this spot oracles are not only the spot price of your own exchange, it is most likely going to be, say, median or weighted average of some spot prices across multiple exchanges. So for example, taken from multiple references. For example, here we have such as Binance, OKX, buy bit, so on and so forth. As a reason why we need a spot article or why we need multiple references we're going to go through. But do note that this is in the general case. It is possible that for exchange there is no such thing as a spot article or it does not take into consideration multiple references. In addition, it is also true that different exchanges have different weightings or take different references with a different amount of importance. So for example, let's say Paradex might think that Binance is more important than hyper liquid things, so so one and so forth. So you have to look at documentation with regards to how they wait or how they view the importance of each of these reference prices. And then we have what is known as a mark price. So we have mark price. And the reason why we have mark price, the mark price is also taken usually from multiple references. So this can be a combination of say the perpetual contract price as well as say by bits or finance perpetual contracts so on and so forth. The reason why we have multiple references is because we don't want price manipulation. So for example let's say your portfolio is holding on to let's say a million dollars in Bitcoin and let's say you have a stop-loss order at some particular price and if your particular exchange is very illiquid, right, if the order book is very thin, it is possible for someone to slam the order book and you manipulate the price towards the liquidation price and therefore getting someone liquidated. Right so for example you have a someone who is really massively long particular coin and this is the liquidation price. And let's say the order book somehow it looks like this right it is very thin so there's some volume here volume here and let's say the order book somehow looks like this, right? It is very thin. So there's some volume here, volume here. And let's say this is only, let's say $10,000. And if someone makes a sell order at $10,000 and you just slam through the entire order book, you're going to have an immediate drop in price and therefore, even though the prices on other exchanges did not get changed, because someone is trying to actively liquidate you, it is possible for them to manipulate the price. However, if we make it such that we use this Oracle prices or we use this Mark prices, if we take multiple references, then what it's going to happen is, even though these prices is manipulated downwards, because, let's say we're taking the median of multiple references, then what it's going to happen is even though these prices is manipulated downwards because let's say we're taking the median of median of multiple references, then what's going to happen is that because the other exchanges are not moving, then the your maximum market value of your assets are not affected. So therefore the mark price does not hit the liquidation price and therefore you will not be liquidated out of your positions. Often usually the reference by which your orders or your liquidations will be triggered and this is to prevent manipulation or to prevent the price volatility that is idiosyncratic to one particular exchange right on the other hand other hand, if every single exchange is going down, then the entire, the price of the coin globally across different exchanges are going down, then it is true that the adverse price movement should affect your liquidation. So that is the concept of the mark price. So with that being said, let's go and take a look at what are the funding components or what are the funding rules when it comes to the case of hyperliquid. So case study we're going to look at hyperliquid. So hyperliquid makes use of a, by the way, before we go into this specifications, do note that these are found on the documentation itself. So you should go to the website, hyperlucous website and check to see if my comments are matching with the documentation. It is possible that whatever I'm saying will be outdated some way in the future, or I have misinterpreted the documentation. So do make sure to do your own homework and make sure that everything I'm saying is matching to the documentation. And I will try my best to explain the ideas and try to try to the the the to to to the. So the first thing you want to take note of is that there is a concept known as spot oracles. Now, in hyperliquid, this is updated every three seconds. And this spot articles affect different components. It affects different variables. One of the variables that it affects funding rates. It also affects components such as the mark price. We have already discussed what each of these components or what each of these variables mean. The mark price is the price that affects things like your margins, your liquidations, as well as order triggers, such as stop loss and take profit orders. The spot oracles are taken as the weighted average. So let's first take into account, say we have multiple exchanges, so exchanges given such as Bynance, bybit, and OKX. Then what the spot, how the spot articles are computed is that each exchange is weighted by some importance figure. So in this case, we have Binance is the most important, so therefore we assign a weight of three followed by OKX and YBIT, and each of these provide one price, the weighted of that as a, and we will have a, each validator is going to provide some price, right? So there are arbitrary number of validators and each of them publish a price with reference to these different exchanges with different rates. And the validators have a different amount of stake, and thenthen from this, we're going to take a stake-weighted median of these validator prices. And this, we will denote it as price or this is what is known as the underlying contract. Or this is what is known as the underlying or the underlying contract with reference to the perpetual derivative. So this PO is we will demark it as the price of the Oracle and this is a validator stake weighted price, stake weighted median of the prices that are published by a validator where each price is taken as a weighted combination of different exchanges prices right and the funding interval occurs at every hour and this funding formula consists of multiple times and th funding formula consists of multiple variables. So we will now discuss how to compute this funding formula. To do that we first need to take into account what are concepts of the funding impact notional. So for now, we will not discuss what this means. Later on, we will address the definition of a funding impact notional. For now, we just define it as a constant, or we can just define it as a variable and it takes on some figures. Funding impact notional. So let's say, I think here we have some majors, right? I believe the majors are probably, the funding impact notional is 20,000 and 6,000 respectively for other perpetual coins. And the meaning of this, we will discuss later. Right, the interest rate is defined as 0.1% every 8 hours. So we will have this every 8 hours. And this represents the difference in borrowing US dollar versus spot borrow. Right, so this is congruent to what you will see in a sex engine. So hyperliquet is 8x, but the interest rate is very similar to what you would see on Bynast versus spot borrow. Basically the idea is that it is more difficult to borrow the spot than it is to borrow in USD. The funding rate, the sign of the funding rate would be, would be, the, would be, the  is that it is more difficult to borrow a spot than it is to borrow in USD. The funding rate, the sign of the funding rate would be basically, the sign of the funding rate would depend on the price relative to the Oracle, right? So if the contract price is greater than this price of the Oracle, then you would expect the funding rate to be positive, otherwise you would expect the funding rate to be positive otherwise you would expect the funding rate to be negative and this follows directly from the discussion that we had in the previous lecture because now let's suppose that we have achieved this funding right then the funding payment that you will have to make to the let's say if you're long a particular perpetual derivative and the funding rate is negative then the funding payment that you will have to make to the, let's say if you're long a particular perpetual derivative and the funding rate is negative, then the funding payment that you will have to pay is actually kept at 4%, right, at a magnitude of 4%. So suppose that you have already obtained this FR, then your funding payment, which we will denote as FP, will be capped at a mean max value of between negative 4 and 4. Now this basically in a lot of documentation you will see it as clamp say x a b now this means that there is a ceiling and a floor and based on the value of X, so the clamp function basically does this. Suppose that x goes like this and it increases and if it's clamped at A and B, then the value of clamp XAB will just be this. Right, so there is a mean value and a max value and if the value is in the middle then we just, it's an identity function for x. So this nonlinear component or this nonlinear function is often known as clamp and in our notes we're going to write that as mean max. Since this funding rate computation is in intervals of 8 hours we're going to take divide by 8 and we're going to have to multiply by the notional exposure right so of the of the position held and this is going to be the position size multiply by the price of the oracle. this stake-weighted median, right? This is the spot Oracle. However, you will later realize that this is not the same in Binance because Binaz uses the mark price. But for now, okay, we just note that the funding payment takes reference of the notional size, which uses the spot oracle price as a measure of the portfolio exposure. Now how do we compute this funding rate then? This funding rate is computed using some premium index. This is some average premium index and you would again use a clamp and then there will be interest rate minus some premium index and this clamp is between 0.05% and negative 0.05%. Now this premium index we're going to explain what this means. We know what this function is. We don't know what this is yet and we know this are just simple constants. So therefore now let's discuss what the premium index is. And the premium index is sampled every five seconds. So in order to find how many samples constitute a funding rate for a particular interval, then you take the number of hours in an interval. For example, you can be 8, 1, 4, etc. Multiply by 60 divided by 5 times 60. Right, because this is the number of samples in a minute, and this is the number of samples in an hour, and this is the number of hours that constitute a particular funding interval. And in this case, or in hyperliquids case, this is just going to be equals to one. Now, before we talk about what this premium index is, we can already try to understand or simplify this formula. Right, so here, if it is true that the interest rate minus the premium index is within this value, then the funding rate is simply going to be this minus P-bar I plus interest rate, equals to interest rate. That means that as long as the value of this figure is between this clamp then the funding rate only equals to the interest rate and later we're going to go to the life funding rate and we're going to see that in fact because of this clamp most of the time what we're going to have is that the funding rate is equal to this value. Not not most of the time but I want to correct that a lot of the time, what we're going to have is that the funding rate is equal to this value. Not most of the time, but I want to correct that a lot of the funding rates are going to be exactly equal to this interest rate. In the hyperliquist documentation, it says that this and this have different terminology and different notations. However, I think that this is likely going to be a mistake. I'm not too sure, but I suspect that that is a mistake. I think they are the exact same term, and I'm not sure why they have different terminology for that. Now, then, now we have to look at the value of P-bar-I. Now, P-bar-I is some weighted mean figure for P-I. Now, again in hyperliquid, they don't tell you how these different PIs are weighted. Now this is what we call the premium index. Now HyperLiquid does not tell you how this is weighted. However, I do suspect that it is just going to be the same as BINANS. So later we go through the BINANCE then we will look at how the different funding, how the different premium indexes are combined to form this P-bar-I. Then what is P-I? So this premium index is computed using some impact price over price of the Oracle. And I think this is the premium index. Again, if you go to the hyperlegic documentation, I believe they have a negative one term. I think that this is a mistake. I think this is a bug in the documentation. I believe it's just going to be the, this fraction over here, and there's no negative one. This might get a bit confusing and you're going to have to go through this step by step again because a lot of the variables are quite new to you, but if you go through them line by line, no, there should be no reason why you can't pick up the different concepts and piece them together. I have to note that there seems to be quite a bit of bugs in hyperlocus documentation, so you might want to cross-reference my lectures as well as the documentation to make sure that if you come across anything that you're confused about, then you can, you know, you won't be misled by by b the documentation. So I think that the negative one term here should be removed in the documentation. First, we talk about the funding rate. We say that the finding rate is composed of some interest rate term, P-bar-I and some number of constants. We know what interest rate are is and we know what these constants are. So we now want to talk about P-bar-I. We know that P-bar-I is a weighted mean of the premium indexes. We don't know how it is weighted. We don't know what is the premium index. But we define the premium index to be some price of the impact over price of the Oracle and we know what the price of the Oracle is. So the only variable that is not clear to us right now is the price is the impact price. So let's define this price impact to be equals to max of price bid minus price oracle minus the price oracle and this are going to be known as known as the impact price price now the impact price now the impact price price is well simply from a high level, without going into the mathematical detail, the impact price is the price that you will receive if you execute the funding impact notional value. It is possible that you would run through the different levels of the order book. So therefore this price bid is not the BBA price, right? It is the impact price which is essentially something like a VWOP. So you're going to have to compute what is the, what is the market impact of executing this funding impact notional on the order book. And this is the impact right. Mathematically, we're going to discuss this when we come to the Binance case. But with this formula is defined, we don't have any terms that are unknown to us, right? Everything is written down in stone. So let's try to make some, let's try to come up with some of the implications of what these terms mean for the actual funding rate. So let's consider two-edge cases. Assume that market is one price and is frictionless. This means that the price is one price is is frictionless. This means that there is no such thing as an impact price, right? You can execute at the mid-price. So there's no such thing as a bid price or an ask price. There's also no such thing as a market impact. If you assume that the market is one price and it's frictionless, then our premium index, sorry, our impact price can now be miswrote this formula. Right, so that is the correction, that is the correct formula. And under this, we're just going to have this so this nonlinear component goes away when we only have a single price and based on this simplification the premium index is simply P minus P O over P O, which is actually very easy for us to interpret. So what does this mean? We can go back to this component over here and we see that, let's try to put this one over here. If P is greater than P.O, it's actually the premium index that is going to be positive, otherwise the premium index is going to be negative. So you see that this premium index is a direct input into the funding rate formula over here. So this is where if say the spot price, let's say this price of the Oracle is over here and the price of the contract is above, then this premium index is going to be positive. And because the premium index is going to be positive, your funding rate is also going to be positive. And if the funding rate is positive, then there is, the longs have to be positive. And if the funding rate is positive, then the longs have to pay shorts. I think I made a mistake over here. I meant to say that the funding rate greater than zero encourages the short of the perpetual futures. Right, so back to here, when the price of the Oracle is greater, when the price is greater than the price of the Oracle, then the premium index is going to be positive. This premium index is a direct component inside the funding rate formula, which is over here, over here, and this, through the mechanism of the funding rate, this encourages the convergence of the futures price towards the Oracle price. And the magnitude of this premium index is essentially the difference in the perpetual price and the spot price as a percentage of the spot price.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        6.0
      ],
      "text": " In this lecture we are going to be looking at the funding formula for HyperLiquid."
    },
    {
      "timestamp": [
        6.0,
        10.68
      ],
      "text": " Before we go into the specifications of each exchange, we want to talk about a particular"
    },
    {
      "timestamp": [
        10.68,
        12.76
      ],
      "text": " concept known as the mark price."
    },
    {
      "timestamp": [
        12.76,
        15.2
      ],
      "text": " So why is there a concept known as the mark price?"
    },
    {
      "timestamp": [
        15.2,
        20.0
      ],
      "text": " So let's just talk about different kinds of prices that we have, right?"
    },
    {
      "timestamp": [
        20.0,
        45.6
      ],
      "text": " First is the actual contract price on a particularthe contract price on a particular exchange say let's say exchange A exchange A right this is bound to list a number of contracts this can be a something like you can have perpetuals on some spot asset so you can have spot contract slash price."
    },
    {
      "timestamp": [
        45.6,
        47.6
      ],
      "text": " You can also have the perpetual contract"
    },
    {
      "timestamp": [
        50.4,
        51.6
      ],
      "text": " Slash price."
    },
    {
      "timestamp": [
        51.6,
        55.6
      ],
      "text": " Now on most exchanges you're going to have both spot and perpetual contracts."
    },
    {
      "timestamp": [
        55.6,
        60.4
      ],
      "text": " However, for perpetual that exists, I have a liquid you only see the perpetual contracts listed."
    },
    {
      "timestamp": [
        60.4,
        88.96
      ],
      "text": " However, this does not mean that there is no such thing as a spot price because remember the perpetual is a derivative and the underlying is a reference price and that must itself be what is known as the spot price. So sometimes what you have are known as spot oracles, right? So this perpetual derivatives without spot, with the underlying spots, often"
    },
    {
      "timestamp": [
        88.96,
        94.72
      ],
      "text": " take reference to this spot price. Right, so this spot oracles are not only the spot price"
    },
    {
      "timestamp": [
        94.72,
        102.8
      ],
      "text": " of your own exchange, it is most likely going to be, say, median or weighted average"
    },
    {
      "timestamp": [
        102.8,
        107.12
      ],
      "text": " of some spot prices across multiple exchanges. So for"
    },
    {
      "timestamp": [
        107.12,
        118.88
      ],
      "text": " example, taken from multiple references. For example, here we have such as Binance,"
    },
    {
      "timestamp": [
        118.88,
        127.68
      ],
      "text": " OKX, buy bit, so on and so forth. As a reason why we need a spot article or why we need multiple"
    },
    {
      "timestamp": [
        127.68,
        133.12
      ],
      "text": " references we're going to go through. But do note that this is in the general case. It is"
    },
    {
      "timestamp": [
        133.12,
        137.92
      ],
      "text": " possible that for exchange there is no such thing as a spot article or it does not take into"
    },
    {
      "timestamp": [
        137.92,
        144.4
      ],
      "text": " consideration multiple references. In addition, it is also true that different exchanges have"
    },
    {
      "timestamp": [
        144.4,
        146.16
      ],
      "text": " different weightings or take"
    },
    {
      "timestamp": [
        146.16,
        152.96
      ],
      "text": " different references with a different amount of importance. So for example, let's say"
    },
    {
      "timestamp": [
        152.96,
        158.72
      ],
      "text": " Paradex might think that Binance is more important than hyper liquid things, so so one and so forth. So"
    },
    {
      "timestamp": [
        158.72,
        163.84
      ],
      "text": " you have to look at documentation with regards to how they wait or how they view"
    },
    {
      "timestamp": [
        163.84,
        168.72
      ],
      "text": " the importance of each of these reference"
    },
    {
      "timestamp": [
        168.72,
        169.8
      ],
      "text": " prices."
    },
    {
      "timestamp": [
        169.8,
        174.24
      ],
      "text": " And then we have what is known as a mark price."
    },
    {
      "timestamp": [
        174.24,
        176.76
      ],
      "text": " So we have mark price."
    },
    {
      "timestamp": [
        176.76,
        180.0
      ],
      "text": " And the reason why we have mark price, the mark price is also taken usually from"
    },
    {
      "timestamp": [
        180.0,
        191.88
      ],
      "text": " multiple references. So this can be a combination of say the perpetual contract"
    },
    {
      "timestamp": [
        191.88,
        197.24
      ],
      "text": " price as well as say by bits or finance perpetual contracts so on and so forth."
    },
    {
      "timestamp": [
        197.24,
        201.8
      ],
      "text": " The reason why we have multiple references is because we don't want price"
    },
    {
      "timestamp": [
        201.8,
        246.16
      ],
      "text": " manipulation. So for example let's say your portfolio is holding on to let's say a million dollars in Bitcoin and let's say you have a stop-loss order at some particular price and if your particular exchange is very illiquid, right, if the order book is very thin, it is possible for someone to slam the order book and you manipulate the price towards the liquidation price and therefore getting someone liquidated. Right so for example you have a someone who is really massively long particular coin and this is the liquidation price. And let's say the order book somehow it looks like this right it is very thin so there's some volume here volume here and let's say the order book somehow looks like this, right? It is very thin."
    },
    {
      "timestamp": [
        246.16,
        248.32
      ],
      "text": " So there's some volume here, volume here."
    },
    {
      "timestamp": [
        248.32,
        252.36
      ],
      "text": " And let's say this is only, let's say $10,000."
    },
    {
      "timestamp": [
        252.36,
        256.6
      ],
      "text": " And if someone makes a sell order at $10,000 and you just slam through the entire order"
    },
    {
      "timestamp": [
        256.6,
        260.16
      ],
      "text": " book, you're going to have an immediate drop in price and therefore, even though"
    },
    {
      "timestamp": [
        260.16,
        266.12
      ],
      "text": " the prices on other exchanges did not get changed, because someone is trying"
    },
    {
      "timestamp": [
        266.12,
        271.64
      ],
      "text": " to actively liquidate you, it is possible for them to manipulate the price."
    },
    {
      "timestamp": [
        271.64,
        279.6
      ],
      "text": " However, if we make it such that we use this Oracle prices or we use this Mark prices, if we"
    },
    {
      "timestamp": [
        279.6,
        283.84
      ],
      "text": " take multiple references, then what it's going to happen is, even though these prices"
    },
    {
      "timestamp": [
        283.84,
        327.44
      ],
      "text": " is manipulated downwards, because, let's say we're taking the median of multiple references, then what it's going to happen is even though these prices is manipulated downwards because let's say we're taking the median of median of multiple references, then what's going to happen is that because the other exchanges are not moving, then the your maximum market value of your assets are not affected. So therefore the mark price does not hit the liquidation price and therefore you will not be liquidated out of your positions. Often usually the reference by which your orders or your liquidations will be triggered and this is to prevent manipulation or to prevent the price volatility that is idiosyncratic to one particular exchange right on the other hand other hand, if every single exchange is going down, then the entire, the price of the"
    },
    {
      "timestamp": [
        327.44,
        325.88
      ],
      "text": " coin globally across different exchanges are going down, then it is true that the adverse price movement should affect your liquidation. So that is the concept of the mark price. So with that being said, let's go and take a look at what are the funding components or what are the funding rules when it comes to the case of hyperliquid. So case study we're going"
    },
    {
      "timestamp": [
        325.88,
        369.0
      ],
      "text": " to look at hyperliquid. So hyperliquid makes use of a, by the way, before we go into this specifications, do note that these are found on the documentation itself. So you should go to the website, hyperlucous website and check to see if my comments are matching with the documentation."
    },
    {
      "timestamp": [
        369.0,
        377.0
      ],
      "text": " It is possible that whatever I'm saying will be outdated some way in the future, or I have misinterpreted the documentation."
    },
    {
      "timestamp": [
        377.0,
        383.0
      ],
      "text": " So do make sure to do your own homework and make sure that everything I'm saying is matching to the documentation."
    },
    {
      "timestamp": [
        383.0,
        409.56
      ],
      "text": " And I will try my best to explain the ideas and try to try to the the the to to to the. So the first thing you want to take note of is that there is a concept known as spot oracles. Now, in hyperliquid, this is updated every three seconds. And this spot articles affect different components."
    },
    {
      "timestamp": [
        409.56,
        411.0
      ],
      "text": " It affects different variables."
    },
    {
      "timestamp": [
        411.0,
        415.0
      ],
      "text": " One of the variables that it affects funding rates."
    },
    {
      "timestamp": [
        415.0,
        419.08
      ],
      "text": " It also affects components such as the mark price."
    },
    {
      "timestamp": [
        419.08,
        423.28
      ],
      "text": " We have already discussed what each of these components or what each of these variables mean."
    },
    {
      "timestamp": [
        423.28,
        448.04
      ],
      "text": " The mark price is the price that affects things like your margins, your liquidations, as well as order triggers, such as stop loss and take profit orders. The spot oracles are taken as the weighted average."
    },
    {
      "timestamp": [
        448.04,
        455.6
      ],
      "text": " So let's first take into account, say we have multiple exchanges, so exchanges given such"
    },
    {
      "timestamp": [
        455.6,
        461.76
      ],
      "text": " as Bynance, bybit, and OKX."
    },
    {
      "timestamp": [
        461.76,
        532.8
      ],
      "text": " Then what the spot, how the spot articles are computed is that each exchange is weighted by some importance figure. So in this case, we have Binance is the most important, so therefore we assign a weight of three followed by OKX and YBIT, and each of these provide one price, the weighted of that as a, and we will have a, each validator is going to provide some price, right? So there are arbitrary number of validators and each of them publish a price with reference to these different exchanges with different rates. And the validators have a different amount of stake, and thenthen from this, we're going to take a stake-weighted median of these validator prices. And this, we will denote it as price or this is what is known as the underlying contract. Or this is what is known as the underlying or the underlying contract with reference to the perpetual derivative."
    },
    {
      "timestamp": [
        532.8,
        540.88
      ],
      "text": " So this PO is we will demark it as the price of the Oracle and this is a validator stake weighted"
    },
    {
      "timestamp": [
        540.88,
        547.68
      ],
      "text": " price, stake weighted median of the prices that are published"
    },
    {
      "timestamp": [
        547.68,
        554.76
      ],
      "text": " by a validator where each price is taken as a weighted combination of different"
    },
    {
      "timestamp": [
        554.76,
        560.28
      ],
      "text": " exchanges prices right and the funding interval occurs at every hour"
    },
    {
      "timestamp": [
        560.28,
        562.24
      ],
      "text": " and this funding formula consists of multiple times"
    },
    {
      "timestamp": [
        562.24,
        585.44
      ],
      "text": " and th funding formula consists of multiple variables. So we will now discuss how to compute this funding formula. To do that we first need to take into account what are concepts of the funding impact notional."
    },
    {
      "timestamp": [
        585.44,
        588.84
      ],
      "text": " So for now, we will not discuss what this means."
    },
    {
      "timestamp": [
        588.84,
        593.28
      ],
      "text": " Later on, we will address the definition of a funding impact notional."
    },
    {
      "timestamp": [
        593.28,
        596.8
      ],
      "text": " For now, we just define it as a constant, or we can just define it as a variable and it"
    },
    {
      "timestamp": [
        596.8,
        600.16
      ],
      "text": " takes on some figures."
    },
    {
      "timestamp": [
        600.16,
        604.56
      ],
      "text": " Funding impact notional."
    },
    {
      "timestamp": [
        604.56,
        608.08
      ],
      "text": " So let's say, I think here we have some majors, right?"
    },
    {
      "timestamp": [
        608.08,
        610.16
      ],
      "text": " I believe the majors are probably,"
    },
    {
      "timestamp": [
        610.16,
        612.48
      ],
      "text": " the funding impact notional is 20,000"
    },
    {
      "timestamp": [
        612.48,
        616.88
      ],
      "text": " and 6,000 respectively for other perpetual coins."
    },
    {
      "timestamp": [
        616.88,
        618.8
      ],
      "text": " And the meaning of this, we will discuss later."
    },
    {
      "timestamp": [
        620.0,
        627.0
      ],
      "text": " Right, the interest rate is defined as 0.1% every 8 hours."
    },
    {
      "timestamp": [
        627.0,
        635.0
      ],
      "text": " So we will have this every 8 hours."
    },
    {
      "timestamp": [
        635.0,
        640.0
      ],
      "text": " And this represents the difference in borrowing US dollar versus spot borrow."
    },
    {
      "timestamp": [
        640.0,
        649.04
      ],
      "text": " Right, so this is congruent to what you will see in a sex engine."
    },
    {
      "timestamp": [
        649.04,
        654.24
      ],
      "text": " So hyperliquet is 8x, but the interest rate is very similar to what you would see on"
    },
    {
      "timestamp": [
        654.24,
        658.4
      ],
      "text": " Bynast versus spot borrow."
    },
    {
      "timestamp": [
        658.4,
        666.48
      ],
      "text": " Basically the idea is that it is more difficult to borrow the spot than it is to borrow in USD. The funding rate, the sign of the funding rate would be, would be, the, would be, the  is that it is more difficult to borrow a spot than it is to borrow in USD."
    },
    {
      "timestamp": [
        666.48,
        672.44
      ],
      "text": " The funding rate, the sign of the funding rate would be basically, the sign of the funding"
    },
    {
      "timestamp": [
        672.44,
        676.36
      ],
      "text": " rate would depend on the price relative to the Oracle, right?"
    },
    {
      "timestamp": [
        676.36,
        684.6
      ],
      "text": " So if the contract price is greater than this price of the Oracle, then you would expect"
    },
    {
      "timestamp": [
        684.6,
        708.48
      ],
      "text": " the funding rate to be positive, otherwise you would expect the funding rate to be positive otherwise you would expect the funding rate to be negative and this follows directly from the discussion that we had in the previous lecture because now let's suppose that we have achieved this funding right then the funding payment that you will have to make to the let's say if you're long a particular perpetual derivative and the funding rate is negative then the funding payment that you will have to make to the, let's say if you're long a particular perpetual derivative and the funding rate is negative, then the funding payment that you will have to pay"
    },
    {
      "timestamp": [
        708.48,
        712.48
      ],
      "text": " is actually kept at 4%, right, at a magnitude of 4%."
    },
    {
      "timestamp": [
        712.48,
        718.12
      ],
      "text": " So suppose that you have already obtained this FR, then your funding payment, which we"
    },
    {
      "timestamp": [
        718.12,
        746.0
      ],
      "text": " will denote as FP, will be capped at a mean max value of between negative 4 and 4. Now this basically in a lot of documentation you will see it as clamp say x a b now this means that there is a ceiling and a floor and based on the value of X, so the clamp function basically does this."
    },
    {
      "timestamp": [
        746.0,
        754.0
      ],
      "text": " Suppose that x goes like this and it increases and if it's clamped at A and B,"
    },
    {
      "timestamp": [
        754.0,
        758.0
      ],
      "text": " then the value of clamp XAB will just be this."
    },
    {
      "timestamp": [
        758.0,
        764.0
      ],
      "text": " Right, so there is a mean value and a max value and if the value is in the middle then we just,"
    },
    {
      "timestamp": [
        764.0,
        765.4
      ],
      "text": " it's an identity"
    },
    {
      "timestamp": [
        765.4,
        768.28
      ],
      "text": " function for x."
    },
    {
      "timestamp": [
        768.28,
        773.76
      ],
      "text": " So this nonlinear component or this nonlinear function is often known as clamp and in"
    },
    {
      "timestamp": [
        773.76,
        777.8
      ],
      "text": " our notes we're going to write that as mean max."
    },
    {
      "timestamp": [
        777.8,
        782.0
      ],
      "text": " Since this funding rate computation is in intervals of 8 hours we're going to take"
    },
    {
      "timestamp": [
        782.0,
        785.04
      ],
      "text": " divide by 8 and we're going to have to multiply by the"
    },
    {
      "timestamp": [
        785.04,
        793.92
      ],
      "text": " notional exposure right so of the of the position held and this is going to be the position size"
    },
    {
      "timestamp": [
        793.92,
        812.4
      ],
      "text": " multiply by the price of the oracle. this stake-weighted median, right? This is"
    },
    {
      "timestamp": [
        812.4,
        817.88
      ],
      "text": " the spot Oracle. However, you will later realize that this is not the same in Binance because"
    },
    {
      "timestamp": [
        817.88,
        823.08
      ],
      "text": " Binaz uses the mark price. But for now, okay, we just note that the funding payment takes"
    },
    {
      "timestamp": [
        823.08,
        826.56
      ],
      "text": " reference of the notional size, which uses"
    },
    {
      "timestamp": [
        826.56,
        834.92
      ],
      "text": " the spot oracle price as a measure of the portfolio exposure."
    },
    {
      "timestamp": [
        834.92,
        837.72
      ],
      "text": " Now how do we compute this funding rate then?"
    },
    {
      "timestamp": [
        837.72,
        849.12
      ],
      "text": " This funding rate is computed using some premium index. This is some average premium index and you would"
    },
    {
      "timestamp": [
        849.12,
        861.56
      ],
      "text": " again use a clamp and then there will be interest rate minus some premium index"
    },
    {
      "timestamp": [
        861.56,
        871.84
      ],
      "text": " and this clamp is between 0.05% and negative 0.05%."
    },
    {
      "timestamp": [
        871.84,
        875.64
      ],
      "text": " Now this premium index we're going to explain what this means."
    },
    {
      "timestamp": [
        875.64,
        877.92
      ],
      "text": " We know what this function is."
    },
    {
      "timestamp": [
        877.92,
        881.68
      ],
      "text": " We don't know what this is yet and we know this are just simple constants."
    },
    {
      "timestamp": [
        881.68,
        884.44
      ],
      "text": " So therefore now let's discuss what the premium index is."
    },
    {
      "timestamp": [
        884.44,
        906.0
      ],
      "text": " And the premium index is sampled every five seconds. So in order to find how many samples constitute a funding rate for a particular interval, then you take the number of hours in an interval. For example, you can be 8, 1, 4, etc."
    },
    {
      "timestamp": [
        906.0,
        912.0
      ],
      "text": " Multiply by 60 divided by 5 times 60."
    },
    {
      "timestamp": [
        912.0,
        917.0
      ],
      "text": " Right, because this is the number of samples in a minute,"
    },
    {
      "timestamp": [
        917.0,
        920.0
      ],
      "text": " and this is the number of samples in an hour,"
    },
    {
      "timestamp": [
        920.0,
        924.0
      ],
      "text": " and this is the number of hours that constitute a particular funding interval."
    },
    {
      "timestamp": [
        924.0,
        929.0
      ],
      "text": " And in this case, or in hyperliquids case, this is just going to be equals to one."
    },
    {
      "timestamp": [
        929.0,
        939.0
      ],
      "text": " Now, before we talk about what this premium index is, we can already try to understand or simplify this formula."
    },
    {
      "timestamp": [
        939.0,
        950.96
      ],
      "text": " Right, so here, if it is true that the interest rate minus the premium index is within this value,"
    },
    {
      "timestamp": [
        954.56,
        961.12
      ],
      "text": " then the funding rate is simply going to be this minus P-bar I plus interest rate,"
    },
    {
      "timestamp": [
        961.12,
        985.0
      ],
      "text": " equals to interest rate. That means that as long as the value of this figure is between this clamp then the funding rate only equals to the interest rate and later we're going to go to the life funding rate and we're going to see that in fact because of this clamp most of the time what we're going to have is that the funding rate is equal to this value. Not not most of the time but I want to correct that a lot of the time, what we're going to have is that the funding rate is equal to this value."
    },
    {
      "timestamp": [
        985.0,
        993.0
      ],
      "text": " Not most of the time, but I want to correct that a lot of the funding rates are going to be exactly equal to this interest rate."
    },
    {
      "timestamp": [
        993.0,
        1004.0
      ],
      "text": " In the hyperliquist documentation, it says that this and this have different terminology and different notations."
    },
    {
      "timestamp": [
        1004.0,
        1009.0
      ],
      "text": " However, I think that this is likely going to be a mistake."
    },
    {
      "timestamp": [
        1009.0,
        1013.0
      ],
      "text": " I'm not too sure, but I suspect that that is a mistake."
    },
    {
      "timestamp": [
        1013.0,
        1019.0
      ],
      "text": " I think they are the exact same term,"
    },
    {
      "timestamp": [
        1019.0,
        1023.0
      ],
      "text": " and I'm not sure why they have different terminology for that."
    },
    {
      "timestamp": [
        1023.0,
        1030.04
      ],
      "text": " Now, then, now we have to look at the value of P-bar-I."
    },
    {
      "timestamp": [
        1030.04,
        1042.04
      ],
      "text": " Now, P-bar-I is some weighted mean figure for P-I."
    },
    {
      "timestamp": [
        1042.04,
        1185.68
      ],
      "text": " Now, again in hyperliquid, they don't tell you how these different PIs are weighted. Now this is what we call the premium index. Now HyperLiquid does not tell you how this is weighted. However, I do suspect that it is just going to be the same as BINANS. So later we go through the BINANCE then we will look at how the different funding, how the different premium indexes are combined to form this P-bar-I. Then what is P-I? So this premium index is computed using some impact price over price of the Oracle. And I think this is the premium index. Again, if you go to the hyperlegic documentation, I believe they have a negative one term. I think that this is a mistake. I think this is a bug in the documentation. I believe it's just going to be the, this fraction over here, and there's no negative one. This might get a bit confusing and you're going to have to go through this step by step again because a lot of the variables are quite new to you, but if you go through them line by line, no, there should be no reason why you can't pick up the different concepts and piece them together. I have to note that there seems to be quite a bit of bugs in hyperlocus documentation, so you might want to cross-reference my lectures as well as the documentation to make sure that if you come across anything that you're confused about, then you can, you know, you won't be misled by by b the documentation. So I think that the negative one term here should be removed in the documentation. First, we talk about the funding rate. We say that the finding rate is composed of some interest rate term, P-bar-I and some number of constants. We know what interest rate are is and we know what these constants are. So we now want to talk about P-bar-I. We know that P-bar-I is a weighted mean of the premium indexes. We don't know how it is weighted. We don't know what is the premium index. But we define the premium index to be some price of the"
    },
    {
      "timestamp": [
        1185.68,
        1192.24
      ],
      "text": " impact over price of the Oracle and we know what the price of the Oracle is. So the only variable"
    },
    {
      "timestamp": [
        1192.24,
        1198.16
      ],
      "text": " that is not clear to us right now is the price is the impact price. So let's define this price"
    },
    {
      "timestamp": [
        1198.16,
        1216.88
      ],
      "text": " impact to be equals to max of price bid minus price oracle minus the price oracle and this are"
    },
    {
      "timestamp": [
        1216.88,
        1220.8
      ],
      "text": " going to be known as known as the impact price price now"
    },
    {
      "timestamp": [
        1220.8,
        1223.52
      ],
      "text": " the impact price now the impact price"
    },
    {
      "timestamp": [
        1223.52,
        1246.56
      ],
      "text": " price is well simply from a high level, without going into the mathematical detail, the impact price is the price that you will receive if you execute the funding impact notional value. It is possible that you would run through"
    },
    {
      "timestamp": [
        1246.56,
        1254.68
      ],
      "text": " the different levels of the order book. So therefore this price bid is not the"
    },
    {
      "timestamp": [
        1254.68,
        1260.64
      ],
      "text": " BBA price, right? It is the impact price which is essentially something like a"
    },
    {
      "timestamp": [
        1260.64,
        1288.4
      ],
      "text": " VWOP. So you're going to have to compute what is the, what is the market impact of executing this funding impact notional on the order book. And this is the impact right. Mathematically, we're going to discuss this when we come to the Binance case. But with this formula is defined, we don't have any terms that are unknown to us, right?"
    },
    {
      "timestamp": [
        1288.4,
        1293.28
      ],
      "text": " Everything is written down in stone."
    },
    {
      "timestamp": [
        1293.28,
        1302.96
      ],
      "text": " So let's try to make some, let's try to come up with some of the implications of what"
    },
    {
      "timestamp": [
        1302.96,
        1308.52
      ],
      "text": " these terms mean for the actual"
    },
    {
      "timestamp": [
        1308.52,
        1324.08
      ],
      "text": " funding rate. So let's consider two-edge cases. Assume that market is one price and is frictionless."
    },
    {
      "timestamp": [
        1324.08,
        1369.0
      ],
      "text": " This means that the price is one price is is frictionless. This means that there is no such thing as an impact price, right? You can execute at the mid-price. So there's no such thing as a bid price or an ask price. There's also no such thing as a market impact. If you assume that the market is one price and it's frictionless, then our premium index, sorry, our impact price can now be miswrote this formula."
    },
    {
      "timestamp": [
        1369.0,
        1379.0
      ],
      "text": " Right, so that is the correction, that is the correct formula."
    },
    {
      "timestamp": [
        1379.0,
        1391.36
      ],
      "text": " And under this, we're just going to have this so"
    },
    {
      "timestamp": [
        1391.36,
        1399.92
      ],
      "text": " this nonlinear component goes away when we only have a single price and based on"
    },
    {
      "timestamp": [
        1399.92,
        1404.28
      ],
      "text": " this simplification the premium index is simply"
    },
    {
      "timestamp": [
        1413.56,
        1416.64
      ],
      "text": " P minus P O over P O, which is actually very easy for us to interpret."
    },
    {
      "timestamp": [
        1416.64,
        1420.0
      ],
      "text": " So what does this mean?"
    },
    {
      "timestamp": [
        1420.0,
        1427.44
      ],
      "text": " We can go back to this component over here and we see that, let's try to put this one"
    },
    {
      "timestamp": [
        1427.44,
        1429.88
      ],
      "text": " over here."
    },
    {
      "timestamp": [
        1429.88,
        1439.44
      ],
      "text": " If P is greater than P.O, it's actually the premium index that is going to be positive,"
    },
    {
      "timestamp": [
        1439.44,
        1443.28
      ],
      "text": " otherwise the premium index is going to be negative."
    },
    {
      "timestamp": [
        1443.28,
        1446.64
      ],
      "text": " So you see that this premium index is a direct"
    },
    {
      "timestamp": [
        1446.64,
        1463.92
      ],
      "text": " input into the funding rate formula over here. So this is where if say the spot price, let's say this"
    },
    {
      "timestamp": [
        1463.92,
        1467.0
      ],
      "text": " price of the Oracle is over here and the price of"
    },
    {
      "timestamp": [
        1467.0,
        1475.28
      ],
      "text": " the contract is above, then this premium index is going to be positive."
    },
    {
      "timestamp": [
        1475.28,
        1480.84
      ],
      "text": " And because the premium index is going to be positive, your funding rate is also going"
    },
    {
      "timestamp": [
        1480.84,
        1485.0
      ],
      "text": " to be positive. And if the funding rate is positive, then there is, the longs have to be positive."
    },
    {
      "timestamp": [
        1487.0,
        1490.0
      ],
      "text": " And if the funding rate is positive, then the longs have to pay shorts."
    },
    {
      "timestamp": [
        1495.0,
        1497.0
      ],
      "text": " I think I made a mistake over here."
    },
    {
      "timestamp": [
        1497.0,
        1504.0
      ],
      "text": " I meant to say that the funding rate greater than zero"
    },
    {
      "timestamp": [
        1508.0,
        1517.0
      ],
      "text": " encourages the short of the perpetual futures. Right, so back to here, when the price of the Oracle is greater, when the price is greater"
    },
    {
      "timestamp": [
        1517.0,
        1522.0
      ],
      "text": " than the price of the Oracle, then the premium index is going to be positive."
    },
    {
      "timestamp": [
        1522.0,
        1547.48
      ],
      "text": " This premium index is a direct component inside the funding rate formula, which is over here, over here, and this, through the mechanism of the funding rate, this encourages the convergence of the futures price towards the Oracle price."
    },
    {
      "timestamp": [
        1547.48,
        1556.4
      ],
      "text": " And the magnitude of this premium index is essentially the difference in the perpetual price"
    },
    {
      "timestamp": [
        1556.4,
        1560.44
      ],
      "text": " and the spot price as a percentage of the spot price."
    }
  ]
}