{
  "text": " Welcome and hello, welcome to QT 410 Elementary Meet Frequency Funding Arbitranche. For those of you who don't know who I am, I am the writer of the Hangon Kwan's Substack Newsletter, as well as the popular lectures on Thinkific, and you can also find them on YouTube for free. Most of you should already know who I am if you're signing up for these lectures and if you don't know you can just Google me otherwise I'm just going to skip the introduction and straight away jump into the lecture course outline. So to begin our lectures we are going to first talk about the theory right talk about some of the components of funding arbitrage, right? To do that, we're going to introduce some notes, right? We're going to write some notes on the funding arbitrage, and then we're going to talk about what kind of end points we need to implement. So we're going to go and write or implement the code, so gateway implementation and then we're going to run this on the AWS and we're going to implement this on two different exchanges right we're going to implement this on hyper liquid and by and by and then of course you can add your own gateway implementations and then we're going to implement the driver code to make the funding arbitrage trader work. I think I already mentioned inside the lecture outline before releasing all lectures right inside the sign up the documentation I wrote that this this code is going to be somewhat messy because this was my first draft of the funding arbitrage bought that I am running myself. We're going to be writing the gateway ourselves. This, there might be bugs of course, right? So actually all of the gateway implementation starting from here is going to be part of the KwanPILIP library. If you don't have access to the Kwanipaip repo, you can email me at Hanukwokwan at Gmail. or you can find me on Twitter and give me a DM and I will add you to the repo. Right, so the Kwan Pilib has evolved, right? So this repo has evolved quite a bit since the version that we are using, right? So this library, I believe, it started somewhere last year or in the beginning of this year. And right now, as I'm filming it, it's in October, right? And I think I have not touched the funding arbitrage component of the lectures. My funding arbitrage driver since April, right? So since April, we have made a lot of evolutions. So the funding arbitrage is running on an old comet of the compilet. Right, so if you go to our GitHub repo comet history, you will see that the actual QomPILIP is significantly different from what we have back in April. So we're going to give you the Comet hash for this version. And if you want, you can skip all of the code implementations for the gateway. And you can use that version of QomPLib. But for demonstrative purposes, we're the the the the the the code implementations for the gateway and you can use that version of QomPai Dip but for demonstrative purposes we're going to show you the entire implementation of the gateway and you can rely on that instead but as I said since this is an old version there might be some bugs and you're trying to run it together with the driver code right right? But no problem. We are going to look at the implementation from scratch. So if you don't want to rely on Quompi-Lib at all, that is perfectly fine. If you want to use QomPi-Lib and skip the code implementation of the gateway lectures, then you can go to our comment hash there. we will be providing. Otherwise, if you want to write a newer version of the funding arbitrage, then you can consider using the updated compilet. All right, so let's just go directly into the implementation and the notes on the theory of funding arbitrage. So let's first break down what the topic is, right? So it is mid-frequency. So mid-frequency means it is not going to be latency sensitive, right? But there is still going to be, we're still going to work with tick data, but it is not going to be so important on, you know, getting the latency down to, you know, some milliseconds, right. We'll see that the sampling of the tick data is not, you know, it's not urgent or because we're taking a number of samples over a few minutes. So you can see that the opportunity for the funding arbitrage will probably last in a span of a few minutes and as long as you build into the position within those few minutes, you're going to be okay so it's not going acency-sensitive. Why we say it's elementary, it's going to be a lot of basic considerations. So elementary because it is very basic or essential, or you can consider them first-order considerations that you need to make in your funding arbitrage system And whenever we come across some thorny issues some issues that is very difficult for us to solve Mathematically or it is a bit difficult because it is difficult to generalize across multiple exchanges, then we're going to just rely on approximations. Right? And the idea is that we give you this skeleton of what a funding arbitrage system might look like, and then you can try to make this approximations more accurate or try to come up with a better model for what we are doing over here. Typically consists of two types of funding arbitrage. There's going to be spot to perpetual a a perpetual a perpetual a perpetual the the to to to be a the to be a the to be a the to be a better to be a better the going to be spot to perpetual arbitrage, and this is going to be per to perb arbitrage. If you look at the differences between the spot and bub markets, well, the spot market is going to be less competitive, right? And the spot market requires a long inventory, right? So unless you can acquire a borrow spot You're going to have to be long inventory which means that this is very often going to be Long spot short pub Pertrade so you're gonna short the negative funding rate inside the perpetual whereas the spot does not have a funding rate involved with it the markets are less competitive, right? You might have an easier approach using the spot to perpetual, but however you need to realize that only one leg can be leveraged, right? You cannot leverage in the spot market, whereas inside the perpetual market, you can use quite a large leverage. Even though the spot market is less competitive than the professional market, it is less liquid. However, you can apply higher leverage inside the professional market. So it is not exactly in Apple's comparison, right? There is a benefit to betting in the spot market. However, you have to use lower leverage, right? But if you don't intend to use that high of a leverage, then you can of course, you might prefer to use spot to perpetual arbitrageual arbitrage. However, in our lectures, we're just going to look at perpetual-to-perpetual arbitrage. The downside, of course, is that it is quite competitive. The reason why this is easier to implement is because there is no positive inventory constraint on the spot market, right? So you can you can be arbitrarily long or short on both legs of the tradeade trade trade trade trade trade trait trait trait trait trait trait trait trait trait thrate rate rate rate rate threat threat  trade so there's no positive inventory constraint. Additionally you can probably employ a higher net leverage for your entire portfolio. If you wish to do so, then this is available. So of course, if it's high net leverage, then the risk you have to take on is that you have the chance of being liquidated on any one of the lakes. If one side makes a lot of money and the other side leaves a lot of money, you can of course be liquidated in one exchange. So you have to make sure that this risk must be managed properly. So this other differences between the two main categories of funding arbitrage between the spot to perp and the per to per arbitrage, right? And this often is implemented in a long-shot neutral way, right? So the funding arbitrage is going to be long short neutral the funding or the cash flows are positive right so cash flows and funding intervals are positive, right? This could be either just one of the legs has a negative funding position and your short set or both the loan and the short sides have a funding component to it. Right? But what do we mean by neutrality of the portfolio? Well, this typically can be broken down into dollar neutrality and beta neutrality. So the net of that is exactly equals zero. So that is dollar neutrality, but sometimes you can have beta neutrality. And some people try to adopt this instead. What it's beta neutrality? Well, suppose you build a regression model, right? And we have, so if you understand the capital asset pricing model, then this beta neutrality is going to be a very easy concept to handle, right? So basically you just build a regression model, and let's say the beta or the sensitivity of a particular asset to the market direction is roughly two. So this means that, you know, if Bitcoin, if the general market moves by 1% and if your asset the the the the the the the the the the th th. So this means that if Bitcoin or if the general market moves by 1% and if your asset moves by 2% to the upside or in the same direction, then we know that the sensitivity of this particular asset is the beta times the movement inside the general market index. So that is the idea of that. So beta neutrality is on net, your beta is the same market index. Right, so that is the idea of that. So beta neutrality is on net, your beta is the same. So for example, if you treat Bitcoin as the market, let's assume BTC is market. And you have some crypto coins, and you have some crypto coins, and let's assume that this is beta 5 and this is beta equals to 2. Now in order for you to be beta neutral, the market always has a beta of 1, so this means that if you're long 1 so and long 3 BTC, then your net beta is going to be 2 times 1 plus 3 times 5. And long 3 BTC, then your net beta is going to be 2 times 1 plus 3 times 1 equals to 5. In order to be base and neutral on the short side, all you have to do is to just short 1k paype, one pep by coin and this is going to be a negative 1 times 5. So this plus this is going to be equal to zero. So this is what we mean by beta neutral. Again if the idea of beta is not clear to you then I suggest that you look at the theory on the capital asset pricing models and how to build a just a simple regression model right but we're not going to go into that right now because that is not within the scope of our lectures.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        7.36
      ],
      "text": " Welcome and hello, welcome to QT 410 Elementary Meet Frequency Funding Arbitranche."
    },
    {
      "timestamp": [
        7.36,
        14.08
      ],
      "text": " For those of you who don't know who I am, I am the writer of the Hangon Kwan's Substack Newsletter,"
    },
    {
      "timestamp": [
        14.08,
        21.6
      ],
      "text": " as well as the popular lectures on Thinkific, and you can also find them on YouTube for free."
    },
    {
      "timestamp": [
        21.6,
        45.76
      ],
      "text": " Most of you should already know who I am if you're signing up for these lectures and if you don't know you can just Google me otherwise I'm just going to skip the introduction and straight away jump into the lecture course outline. So to begin our lectures we are going to first talk about the theory right talk about some of the components of funding arbitrage, right?"
    },
    {
      "timestamp": [
        45.76,
        50.64
      ],
      "text": " To do that, we're going to introduce some notes, right? We're going to write some notes"
    },
    {
      "timestamp": [
        50.64,
        55.8
      ],
      "text": " on the funding arbitrage, and then we're going to talk about what kind of end points we need"
    },
    {
      "timestamp": [
        55.8,
        89.44
      ],
      "text": " to implement. So we're going to go and write or implement the code, so gateway implementation and then we're going to run this on the AWS and we're going to implement this on two different exchanges right we're going to implement this on hyper liquid and by and by and then of course you can add your own gateway implementations and then we're going to implement the driver code to make the funding arbitrage trader work. I think I already mentioned inside the lecture outline"
    },
    {
      "timestamp": [
        90.48,
        96.72
      ],
      "text": " before releasing all lectures right inside the sign up the documentation I wrote that this"
    },
    {
      "timestamp": [
        96.72,
        105.72
      ],
      "text": " this code is going to be somewhat messy because this was my first draft of the funding"
    },
    {
      "timestamp": [
        105.72,
        112.44
      ],
      "text": " arbitrage bought that I am running myself. We're going to be writing the gateway ourselves."
    },
    {
      "timestamp": [
        112.44,
        119.92
      ],
      "text": " This, there might be bugs of course, right? So actually all of the gateway implementation"
    },
    {
      "timestamp": [
        119.92,
        147.52
      ],
      "text": " starting from here is going to be part of the KwanPILIP library. If you don't have access to the Kwanipaip repo, you can email me at Hanukwokwan at Gmail. or you can find me on Twitter and give me a DM and I will add you to the repo. Right, so the Kwan Pilib has evolved, right? So this repo has evolved quite a bit since the version that we are using,"
    },
    {
      "timestamp": [
        147.52,
        153.84
      ],
      "text": " right? So this library, I believe, it started somewhere last year or in the beginning of this year."
    },
    {
      "timestamp": [
        153.84,
        161.36
      ],
      "text": " And right now, as I'm filming it, it's in October, right? And I think I have not touched"
    },
    {
      "timestamp": [
        163.36,
        167.0
      ],
      "text": " the funding arbitrage component of the lectures."
    },
    {
      "timestamp": [
        167.0,
        170.0
      ],
      "text": " My funding arbitrage driver since April, right?"
    },
    {
      "timestamp": [
        170.0,
        175.0
      ],
      "text": " So since April, we have made a lot of evolutions."
    },
    {
      "timestamp": [
        175.0,
        181.0
      ],
      "text": " So the funding arbitrage is running on an old comet of the compilet."
    },
    {
      "timestamp": [
        181.0,
        185.44
      ],
      "text": " Right, so if you go to our GitHub repo comet history,"
    },
    {
      "timestamp": [
        185.44,
        190.8
      ],
      "text": " you will see that the actual QomPILIP"
    },
    {
      "timestamp": [
        190.8,
        194.64
      ],
      "text": " is significantly different from what we have back in April."
    },
    {
      "timestamp": [
        194.64,
        199.6
      ],
      "text": " So we're going to give you the Comet hash for this version."
    },
    {
      "timestamp": [
        199.6,
        227.84
      ],
      "text": " And if you want, you can skip all of the code implementations for the gateway. And you can use that version of QomPLib. But for demonstrative purposes, we're the the the the the the code implementations for the gateway and you can use that version of QomPai Dip but for demonstrative purposes we're going to show you the entire implementation of the gateway and you can rely on that instead but as I said since this is an old version there might be some bugs and you're trying to run it together with the driver code right right? But no problem. We are going to look at the implementation from scratch."
    },
    {
      "timestamp": [
        227.84,
        230.52
      ],
      "text": " So if you don't want to rely on Quompi-Lib at all,"
    },
    {
      "timestamp": [
        230.52,
        231.72
      ],
      "text": " that is perfectly fine."
    },
    {
      "timestamp": [
        231.72,
        221.44
      ],
      "text": " If you want to use QomPi-Lib and skip the code implementation of the gateway lectures, then you can go to our comment hash there. we will be providing."
    },
    {
      "timestamp": [
        221.44,
        224.44
      ],
      "text": " Otherwise, if you want to write a newer version"
    },
    {
      "timestamp": [
        224.44,
        226.92
      ],
      "text": " of the funding arbitrage, then you can consider"
    },
    {
      "timestamp": [
        226.92,
        230.36
      ],
      "text": " using the updated compilet."
    },
    {
      "timestamp": [
        230.36,
        265.6
      ],
      "text": " All right, so let's just go directly into the implementation and the notes on the theory of funding arbitrage. So let's first break down what the topic is, right? So it is mid-frequency. So mid-frequency means it is not going to be latency sensitive,"
    },
    {
      "timestamp": [
        265.6,
        271.76
      ],
      "text": " right? But there is still going to be, we're still going to work with tick data,"
    },
    {
      "timestamp": [
        271.76,
        278.56
      ],
      "text": " but it is not going to be so important on, you know, getting the latency down to, you know,"
    },
    {
      "timestamp": [
        278.56,
        465.4
      ],
      "text": " some milliseconds, right. We'll see that the sampling of the tick data is not, you know, it's not urgent or because we're taking a number of samples over a few minutes. So you can see that the opportunity for the funding arbitrage will probably last in a span of a few minutes and as long as you build into the position within those few minutes, you're going to be okay so it's not going acency-sensitive. Why we say it's elementary, it's going to be a lot of basic considerations. So elementary because it is very basic or essential, or you can consider them first-order considerations that you need to make in your funding arbitrage system And whenever we come across some thorny issues some issues that is very difficult for us to solve Mathematically or it is a bit difficult because it is difficult to generalize across multiple exchanges, then we're going to just rely on approximations. Right? And the idea is that we give you this skeleton of what a funding arbitrage system might look like, and then you can try to make this approximations more accurate or try to come up with a better model for what we are doing over here. Typically consists of two types of funding arbitrage. There's going to be spot to perpetual a a perpetual a perpetual a perpetual the the to to to be a the to be a the to be a the to be a better to be a better the going to be spot to perpetual arbitrage, and this is going to be per to perb arbitrage. If you look at the differences between the spot and bub markets, well, the spot market is going to be less competitive, right? And the spot market requires a long inventory, right? So unless you can acquire a borrow spot You're going to have to be long inventory which means that this is very often going to be Long spot short pub Pertrade so you're gonna short the negative funding rate inside the perpetual whereas the spot does not have a funding rate involved with it the markets are less competitive, right? You might have an easier approach using the spot to perpetual, but however you need to realize that only one leg can be leveraged, right? You cannot leverage in the spot market, whereas inside the perpetual market, you can use quite a large leverage. Even though the spot market is less competitive than the professional market, it is less liquid. However, you can apply higher leverage inside the professional market. So it is not exactly in Apple's comparison, right? There is a benefit to betting in the spot market. However, you have to use lower leverage, right? But if you don't intend to use that high of a leverage, then you can of course, you might prefer to use spot to perpetual arbitrageual arbitrage. However, in our lectures, we're just going to look at perpetual-to-perpetual arbitrage. The downside, of course, is that it is quite competitive. The reason why this is easier to implement is because there is no positive inventory constraint on the spot market, right? So you can you can be arbitrarily long or short on both legs of the tradeade trade trade trade trade trade trait trait trait trait trait trait trait trait trait thrate rate rate rate rate threat threat  trade so there's no positive inventory"
    },
    {
      "timestamp": [
        465.4,
        485.0
      ],
      "text": " constraint. Additionally you can probably employ a higher net leverage for your entire portfolio. If you wish to do so, then this is available."
    },
    {
      "timestamp": [
        485.0,
        492.0
      ],
      "text": " So of course, if it's high net leverage, then the risk you have to take on is that you"
    },
    {
      "timestamp": [
        492.0,
        497.0
      ],
      "text": " have the chance of being liquidated on any one of the lakes."
    },
    {
      "timestamp": [
        497.0,
        500.0
      ],
      "text": " If one side makes a lot of money and the other side leaves a lot of money,"
    },
    {
      "timestamp": [
        500.0,
        502.0
      ],
      "text": " you can of course be liquidated in one exchange."
    },
    {
      "timestamp": [
        502.0,
        508.92
      ],
      "text": " So you have to make sure that this risk must be managed properly."
    },
    {
      "timestamp": [
        514.12,
        517.84
      ],
      "text": " So this other differences between the two main categories of funding arbitrage between"
    },
    {
      "timestamp": [
        517.84,
        545.4
      ],
      "text": " the spot to perp and the per to per arbitrage, right? And this often is implemented in a long-shot neutral way, right? So the funding arbitrage is going to be long short neutral the funding or the cash flows are positive right so cash flows and funding intervals are positive, right?"
    },
    {
      "timestamp": [
        545.4,
        550.16
      ],
      "text": " This could be either just one of the legs has a negative funding position and your short"
    },
    {
      "timestamp": [
        550.16,
        555.6
      ],
      "text": " set or both the loan and the short sides have a funding component to it."
    },
    {
      "timestamp": [
        555.6,
        563.52
      ],
      "text": " Right? But what do we mean by neutrality of the portfolio? Well, this typically can be broken"
    },
    {
      "timestamp": [
        563.52,
        607.0
      ],
      "text": " down into dollar neutrality and beta neutrality. So the net of that is exactly equals zero. So that is dollar neutrality, but sometimes you can have beta neutrality. And some people try to adopt this instead. What it's beta neutrality? Well, suppose you build a regression model, right? And we have, so if you understand the capital asset pricing model, then this beta neutrality is going to be a very easy concept to handle, right? So basically you just build a regression model, and let's say the beta or the sensitivity of a particular asset to the market direction is roughly two. So this means that, you know, if Bitcoin, if the general market moves by 1% and if your asset the the the the the the the the the the th th. So this means that if Bitcoin or if the general market moves by 1% and if your"
    },
    {
      "timestamp": [
        607.0,
        615.2
      ],
      "text": " asset moves by 2% to the upside or in the same direction, then we know that the sensitivity"
    },
    {
      "timestamp": [
        615.2,
        623.88
      ],
      "text": " of this particular asset is the beta times the movement inside the general market index."
    },
    {
      "timestamp": [
        623.88,
        625.0
      ],
      "text": " So that is the idea of that. So beta neutrality is on net, your beta is the same market index. Right, so that is the idea of that."
    },
    {
      "timestamp": [
        625.0,
        629.0
      ],
      "text": " So beta neutrality is on net, your beta is the same."
    },
    {
      "timestamp": [
        629.0,
        633.0
      ],
      "text": " So for example, if you treat Bitcoin as the market,"
    },
    {
      "timestamp": [
        633.0,
        635.0
      ],
      "text": " let's assume BTC is market."
    },
    {
      "timestamp": [
        635.0,
        639.0
      ],
      "text": " And you have some crypto coins,"
    },
    {
      "timestamp": [
        639.0,
        649.28
      ],
      "text": " and you have some crypto coins, and let's assume that this is beta 5 and this is beta equals"
    },
    {
      "timestamp": [
        649.28,
        655.76
      ],
      "text": " to 2. Now in order for you to be beta neutral, the market always has a beta of 1, so this means"
    },
    {
      "timestamp": [
        655.76,
        659.52
      ],
      "text": " that if you're long 1 so and long 3 BTC, then your net beta is going to be 2 times 1 plus 3 times 5."
    },
    {
      "timestamp": [
        660.72,
        670.0
      ],
      "text": " And long 3 BTC, then your net beta is going to be 2 times 1 plus 3 times 1 equals to 5."
    },
    {
      "timestamp": [
        670.0,
        677.0
      ],
      "text": " In order to be base and neutral on the short side, all you have to do is to just short 1k paype,"
    },
    {
      "timestamp": [
        677.0,
        682.0
      ],
      "text": " one pep by coin and this is going to be a negative 1 times 5."
    },
    {
      "timestamp": [
        682.0,
        685.52
      ],
      "text": " So this plus this is going to be equal to zero. So this is"
    },
    {
      "timestamp": [
        685.52,
        692.0
      ],
      "text": " what we mean by beta neutral. Again if the idea of beta is not clear to you then I"
    },
    {
      "timestamp": [
        692.0,
        700.0
      ],
      "text": " suggest that you look at the theory on the capital asset pricing models and how to"
    },
    {
      "timestamp": [
        700.0,
        703.52
      ],
      "text": " build a just a simple regression model right but we're not going to go into that"
    },
    {
      "timestamp": [
        703.52,
        706.64
      ],
      "text": " right now because that is not within the scope of our lectures."
    }
  ]
}