{
  "text": " Okay so continuing we want to break down what funding arbitrage means to us, right? So we want to take a deeper look at the concept of funding arbitrage and in particular, pub-to-pub funding arbitrage. So what is a perp? Or we can just extend this and be more precise with it. It is said to be a linear perpetual contract. Right so this contract is made so that you know you can bet on the spot market on the movement of the sport market and as opposed to having a short constraint right you can since it is a derivative right there is no longer a short constraint on the underlying on on the derivative of the underlying right so you can sort of treat it like a futurist market and we're able to bet on the price movements of the underlying using this derivative. It is linear because it is not like a, it's not an option market, right? So the concept of linearity refers to the payoff structure, right? So if the price of the underlying spot, underlying contract moves by some 5%, then the payoff is also, you know, is linear with respect to the underlying price movements. Whereas if you look at something like a options contract, then if you look at the call option, then your payoff sort of looks like that when this is the strike of the option and as the price moves beyond the price of the strike option of the strike price then your payoff structure is nonlinear right because the payoff is this minus K and zero so because your payoff is nonlinear then an option is said to be a nonlinear contract or nonlinear derivative whereas in our case we have a linear contract. Why perpetual? So as opposed to a expiring futures, so for example you can buy a futures market, so on wheat or on milk, right? These are contracts that have an expiry date and they have a according settlement. So as opposed to futures that expire, our perpetual futures or our perpetual contract does not have an expiry, right? So futures that expire use settlement, right? So futures that expire use settlement use settlement. What is a settlement? A cash settlement or delivery of the futures contract or deliver with the underlying. So for example you can have if you buy cow futures now you're going to receive a cattle of cows or if you have a cash settlement then you're going to receive the difference between the futures price and the underlying spot price. And this is the reason for why there is a mechanical tying of the futures price and underlying spot price because there is a base, the price basis will converge, otherwise there will be arbitrage in which you can buy the futures and short the spot or something equivalent. So let me talk about the future the future the future the future the futures the futures the futures the futures the futures the futures the futures the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future  short, the spot or something equivalent. So let me talk about features that expire. It is the settlement or is the delivery of the underlying that allows there to be a no-arbitratch price, right? Or at least in the theory, there is a mechanical convergence of the future's price towards the spot price. However, if the futures or if the perpetual contract never expires, then, then, then, then, then, then, then, then, then, the the the the the the the the the the towards the spot price. However, if the futures or if the linear perpetual contract never expires, then what is it that allows this price to converge? And this in fact turns out to be the funding rates, right? So as opposed to settlement that causes this convergence, we have the funding rate that allows this convergence. So funding rate is the concept or is the mechanism that ensures or rather it encourages convergence of the market participants converges the puke to spot. Right so whatever the ppup to spots. Right, so whatever the perpetual contract is tracking, right, the underlying, it is the funding rate that encourages this convergence. And how does it do it? What is the funding rate? And how does the funding rate encourage this convergence, right? The funding rate is, and how does the funding rate encourage this convergence between the perpetual and spot prices? Well, this is done because the funding rate itself is a cash flow between people who have longed the contract and who are short the contract. Funding rate is not a fee that you have to pay to the brokerage or that you have to pay to Binaunce, it is not that it is a cash flow between people who are net longer contract and who are short of contract. And to do that, well, let's just plot a price plot, right? So for example here is the price of a spot. And suppose the spot price moves like this this is the price of the underlying contract and then you have a perpetual contract that is supposedly tracking this spot price right sometimes it's above sometimes it's below and let's just say the price somehow looks like this so whenever the price deviates then of course there should be a mechanism that tying these two prices together. And how should we encourage this? Of course we should have the cash flow. And this cash flow, now if this A is greater than zero, then this cash flow should encourage people to short the PIRP along the spot. And in this case, if A is less than zero, then it should encourage people to long the purp and sharp the spot. Right? So therefore we know just based on, just without an understanding of the finding of the try. Right. So, therefore, we know, just based on, just without an understanding of the finding of the the spot. Right? So therefore we know just based on just without an understanding of the finding of a charge right. All we know is that finding arbitrage encourages the convergence between the perpetual price and the spot price through a cash flow mechanism. Through this logic we can derive that a positive cash flow should be derived upon people or traders who are short of perpetual when the perpetual price is above the spot price and this is exactly what it is. You have to note that across different exchanges the funding specifications are going to be different so for example there are many different exchanges right so there are by we have Binance you can have bybit okay X hyperlocate paradox so on and so forth and there are two major classes of exchanges, right? These are sex exchanges and these are dex exchanges. And in general, this has different funding specifications. What are the differences that these funding specifications can have? For example, they can defer in the interval of funding payments. For example, you can have one hour funding payments, you can have four hour finding payments and eight hour funding payments. So, for example, every eight hours, the traders, some traders on Binains will have to pay the counterparty, whereas on exchanges like hyperlocate, you're going to be made at every every single interval and every hour. And this difference in the intervals is going to affect how we look at the funding arbitrage or how we view the prices of the individual contracts on different exchanges. Of course they're also going to be somewhat different in computation, right? So this can be differences in computation means the funding formula is different. For example, how do you wait different? We computed on different notion of exposure, whereas the notion of exposure is taking a reference from a different price. So we're going to explore the differences between these funding specifications through a case study, rather  talking about these differences in theory. We're going to talk about these two exchanges, HyperLiquid and Bynance, and we're going to break down what is the funding formula in each of these exchanges and see how they are different, right? So that is what we're going to do inside of our next lecture. Now that we have sort of broken down what exactly the funding rate on and the concept of why the funding rate exists, we can now take a look at how this funding rate is computed across two different exchanges.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        6.56
      ],
      "text": " Okay so continuing we want to break down what funding arbitrage means to us, right?"
    },
    {
      "timestamp": [
        6.56,
        13.44
      ],
      "text": " So we want to take a deeper look at the concept of funding arbitrage and in particular,"
    },
    {
      "timestamp": [
        13.44,
        127.76
      ],
      "text": " pub-to-pub funding arbitrage. So what is a perp? Or we can just extend this and be more precise with it. It is said to be a linear perpetual contract. Right so this contract is made so that you know you can bet on the spot market on the movement of the sport market and as opposed to having a short constraint right you can since it is a derivative right there is no longer a short constraint on the underlying on on the derivative of the underlying right so you can sort of treat it like a futurist market and we're able to bet on the price movements of the underlying using this derivative. It is linear because it is not like a, it's not an option market, right? So the concept of linearity refers to the payoff structure, right? So if the price of the underlying spot, underlying contract moves by some 5%, then the payoff is also, you know, is linear with respect to the underlying price movements. Whereas if you look at something like a options contract, then if you look at the call option, then your payoff sort of looks like that when this is the strike of the option and as the price moves beyond the price of the strike option of the strike price then your payoff structure is nonlinear right because the payoff is this minus K and zero so because your payoff is nonlinear then an option is said to be a nonlinear contract or nonlinear derivative whereas in our case"
    },
    {
      "timestamp": [
        127.76,
        130.48
      ],
      "text": " we have a linear contract."
    },
    {
      "timestamp": [
        130.48,
        131.48
      ],
      "text": " Why perpetual?"
    },
    {
      "timestamp": [
        131.48,
        139.96
      ],
      "text": " So as opposed to a expiring futures, so for example you can buy a futures market, so on wheat"
    },
    {
      "timestamp": [
        139.96,
        144.96
      ],
      "text": " or on milk, right? These are contracts that have an expiry date and they have"
    },
    {
      "timestamp": [
        144.96,
        185.4
      ],
      "text": " a according settlement. So as opposed to futures that expire, our perpetual futures or our perpetual contract does not have an expiry, right? So futures that expire use settlement, right? So futures that expire use settlement use settlement. What is a settlement? A cash settlement or delivery of the futures contract or deliver with the underlying. So for example you can have if you buy cow futures now you're going to receive a cattle of cows or if you have a cash settlement then you're"
    },
    {
      "timestamp": [
        185.4,
        189.64
      ],
      "text": " going to receive the difference between the futures price and the underlying spot price."
    },
    {
      "timestamp": [
        189.64,
        193.96
      ],
      "text": " And this is the reason for why there is a mechanical tying of the futures price and underlying"
    },
    {
      "timestamp": [
        193.96,
        198.64
      ],
      "text": " spot price because there is a base, the price basis will converge, otherwise there will"
    },
    {
      "timestamp": [
        198.64,
        206.28
      ],
      "text": " be arbitrage in which you can buy the futures and short the spot or something equivalent. So let me talk about the future the future the future the future the futures the futures the futures the futures the futures the futures the futures the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future the future  short, the spot or something equivalent."
    },
    {
      "timestamp": [
        206.28,
        210.32
      ],
      "text": " So let me talk about features that expire."
    },
    {
      "timestamp": [
        210.32,
        216.72
      ],
      "text": " It is the settlement or is the delivery of the underlying that allows there to be a no-arbitratch"
    },
    {
      "timestamp": [
        216.72,
        217.72
      ],
      "text": " price, right?"
    },
    {
      "timestamp": [
        217.72,
        221.88
      ],
      "text": " Or at least in the theory, there is a mechanical convergence of the future's price towards"
    },
    {
      "timestamp": [
        221.88,
        222.88
      ],
      "text": " the spot price."
    },
    {
      "timestamp": [
        222.88,
        231.4
      ],
      "text": " However, if the futures or if the perpetual contract never expires, then, then, then, then, then, then, then, then, then, the the the the the the the the the the towards the spot price. However, if the futures or if the linear perpetual contract never expires, then what is"
    },
    {
      "timestamp": [
        231.4,
        233.84
      ],
      "text": " it that allows this price to converge?"
    },
    {
      "timestamp": [
        233.84,
        236.32
      ],
      "text": " And this in fact turns out to be the funding rates, right?"
    },
    {
      "timestamp": [
        236.32,
        242.84
      ],
      "text": " So as opposed to settlement that causes this convergence, we have the funding rate that allows"
    },
    {
      "timestamp": [
        242.84,
        248.0
      ],
      "text": " this convergence. So funding rate"
    },
    {
      "timestamp": [
        248.0,
        256.0
      ],
      "text": " is the concept or is the mechanism that ensures or rather it encourages"
    },
    {
      "timestamp": [
        256.0,
        261.0
      ],
      "text": " convergence of the market participants converges the puke to spot."
    },
    {
      "timestamp": [
        261.0,
        267.0
      ],
      "text": " Right so whatever the ppup to spots."
    },
    {
      "timestamp": [
        267.0,
        276.0
      ],
      "text": " Right, so whatever the perpetual contract is tracking, right, the underlying, it is the funding rate that encourages this convergence."
    },
    {
      "timestamp": [
        276.0,
        278.0
      ],
      "text": " And how does it do it? What is the funding rate?"
    },
    {
      "timestamp": [
        278.0,
        282.0
      ],
      "text": " And how does the funding rate encourage this convergence, right?"
    },
    {
      "timestamp": [
        282.0,
        305.68
      ],
      "text": " The funding rate is, and how does the funding rate encourage this convergence between the perpetual and spot prices? Well, this is done because the funding rate itself is a cash flow between people who have longed the contract and who are short the contract. Funding rate is not a fee that you have to pay to the brokerage or that you have to pay to"
    },
    {
      "timestamp": [
        305.68,
        312.08
      ],
      "text": " Binaunce, it is not that it is a cash flow between people who are net longer contract"
    },
    {
      "timestamp": [
        312.08,
        314.4
      ],
      "text": " and who are short of contract."
    },
    {
      "timestamp": [
        314.4,
        318.4
      ],
      "text": " And to do that, well, let's just plot a price plot, right?"
    },
    {
      "timestamp": [
        318.4,
        324.2
      ],
      "text": " So for example here is the price of a spot."
    },
    {
      "timestamp": [
        324.2,
        327.64
      ],
      "text": " And suppose the spot price moves like this this is the price"
    },
    {
      "timestamp": [
        327.64,
        332.44
      ],
      "text": " of the underlying contract and then you have a perpetual contract that is"
    },
    {
      "timestamp": [
        332.44,
        336.68
      ],
      "text": " supposedly tracking this spot price right sometimes it's above sometimes it's"
    },
    {
      "timestamp": [
        336.68,
        343.2
      ],
      "text": " below and let's just say the price somehow looks like this so whenever"
    },
    {
      "timestamp": [
        343.2,
        347.84
      ],
      "text": " the price deviates then of course there should"
    },
    {
      "timestamp": [
        347.84,
        354.32
      ],
      "text": " be a mechanism that tying these two prices together. And how should we encourage this? Of course"
    },
    {
      "timestamp": [
        354.32,
        364.32
      ],
      "text": " we should have the cash flow. And this cash flow, now if this A is greater than zero,"
    },
    {
      "timestamp": [
        364.32,
        372.24
      ],
      "text": " then this cash flow should encourage people to short the"
    },
    {
      "timestamp": [
        372.24,
        378.88
      ],
      "text": " PIRP along the spot."
    },
    {
      "timestamp": [
        378.88,
        426.0
      ],
      "text": " And in this case, if A is less than zero, then it should encourage people to long the purp and sharp the spot. Right? So therefore we know just based on, just without an understanding of the finding of the try. Right. So, therefore, we know, just based on, just without an understanding of the finding of the the spot. Right? So therefore we know just based on just without an understanding of the finding of a charge right. All we know is that finding arbitrage encourages the convergence between the perpetual price and the spot price through a cash flow mechanism. Through this logic we can derive that a positive cash flow should be derived"
    },
    {
      "timestamp": [
        426.0,
        432.32
      ],
      "text": " upon people or traders who are short of perpetual when the perpetual price is"
    },
    {
      "timestamp": [
        432.32,
        436.4
      ],
      "text": " above the spot price and this is exactly what it is."
    },
    {
      "timestamp": [
        436.4,
        442.76
      ],
      "text": " You have to note that across different exchanges the funding"
    },
    {
      "timestamp": [
        442.76,
        466.4
      ],
      "text": " specifications are going to be different so for example there are many different exchanges right so there are by we have Binance you can have bybit okay X hyperlocate paradox so on and so forth and there are two major classes of exchanges, right?"
    },
    {
      "timestamp": [
        466.4,
        472.4
      ],
      "text": " These are sex exchanges and these are dex exchanges."
    },
    {
      "timestamp": [
        472.4,
        476.8
      ],
      "text": " And in general, this has different funding specifications."
    },
    {
      "timestamp": [
        476.8,
        481.2
      ],
      "text": " What are the differences that these funding specifications can have?"
    },
    {
      "timestamp": [
        481.2,
        484.7
      ],
      "text": " For example, they can defer in the interval of funding payments."
    },
    {
      "timestamp": [
        484.7,
        510.16
      ],
      "text": " For example, you can have one hour funding payments, you can have four hour finding payments and eight hour funding payments. So, for example, every eight hours, the traders, some traders on Binains will have to pay the counterparty, whereas on exchanges like hyperlocate, you're going to be made at every every single interval and every hour. And this difference in the intervals is going to affect how we"
    },
    {
      "timestamp": [
        510.16,
        514.72
      ],
      "text": " look at the funding arbitrage or how we view the prices of the individual contracts on"
    },
    {
      "timestamp": [
        514.72,
        518.4
      ],
      "text": " different exchanges. Of course they're also going to be somewhat different in"
    },
    {
      "timestamp": [
        518.4,
        566.08
      ],
      "text": " computation, right? So this can be differences in computation means the funding formula is different. For example, how do you wait different? We computed on different notion of exposure, whereas the notion of exposure is taking a reference from a different price. So we're going to explore the differences between these funding specifications through a case study, rather  talking about these differences in theory. We're going to talk about these two exchanges, HyperLiquid and Bynance, and we're going to break down what is the funding formula in each of these exchanges and see how they are different, right? So that is what we're going to do inside of our"
    },
    {
      "timestamp": [
        566.08,
        571.92
      ],
      "text": " next lecture. Now that we have sort of broken down what exactly the funding rate on and the"
    },
    {
      "timestamp": [
        571.92,
        578.56
      ],
      "text": " concept of why the funding rate exists, we can now take a look at how this funding rate is computed"
    },
    {
      "timestamp": [
        578.56,
        580.0
      ],
      "text": " across two different exchanges."
    }
  ]
}